[
  {
    "id": 1992793,
    "url": "https://remotive.com/remote-jobs/data/director-omnichannel-media-analytics-1992793",
    "title": "Director, Omnichannel Media Analytics",
    "company_name": "Springandbond",
    "company_logo": "https://remotive.com/job/1992793/logo",
    "category": "Data Analysis",
    "tags": [
      "sql",
      "analytics",
      "tableau"
    ],
    "job_type": "full_time",
    "publication_date": "2025-04-06T22:50:05",
    "candidate_required_location": "USA",
    "salary": "",
    "description": "<p style=\"min-height:1.5em\"><strong>About us: </strong></p><p style=\"min-height:1.5em\">Spring &amp; Bond is a digital media agency and consultancy specializing in helping pharmaceutical and medical device manufacturers create robust, omnichannel media strategies for both healthcare professionals (HCPs) and consumer audiences. We emphasize transparency and client empowerment through comprehensive services, including customer journey planning, media strategy and activation, technology evaluation, in-house capability development, and training.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What you’ll do:</strong></p><p style=\"min-height:1.5em\">We are looking for a<strong> Director, Omnichannel Media Analytics </strong>to help lead our analytics program, defining reporting frameworks that capture key business outcomes and driving optimization efforts.  You will be responsible for developing the tracking infrastructure and creating data-informed narratives that address real-world business opportunities and challenges. Reporting to the VP, Business Intelligence, your role will involve elevating and optimizing current reporting programs, processes, and outputs, as well as finding innovative ways to support clients with a data-driven focus in collaboration with the corporate analytics</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Your Responsibilities:</strong></p><ul style=\"\"><li style=\"\"><p style=\"min-height:1.5em\">Drive Spring &amp; Bond’s reporting and analytics program</p></li><li style=\"\"><p style=\"min-height:1.5em\">Serve as the liaison to the VP, Business Intelligence, and collaborate closely with the data engineering team, strategy team, and cross-office peers to enhance Spring &amp; Bond’s data initiatives, analytics programs, and practices</p></li><li style=\"\"><p style=\"min-height:1.5em\">Lead cross-functional projects using data modeling and analysis techniques to uncover insights that guide strategic decisions</p></li><li style=\"\"><p style=\"min-height:1.5em\">Examine, interpret, and communicate the results and business impact of analytical initiatives to key internal stakeholders and client teams</p></li><li style=\"\"><p style=\"min-height:1.5em\">Support omnichannel initiatives and coordinate with marketing technology on methodology and execution of customer campaigns</p></li><li style=\"\"><p style=\"min-height:1.5em\">Develop and own analysis approaches for engagement activities, targeting analysis, reporting, and ad hoc requests with a focus on omnichannel</p></li><li style=\"\"><p style=\"min-height:1.5em\">Develop models and synthesize recommendations on the best path forward for specific products</p></li><li style=\"\"><p style=\"min-height:1.5em\">Oversee projects and provide guidance to project teams on research and client-related issues</p></li></ul><ul style=\"\"><li style=\"\"><p style=\"min-height:1.5em\">Own and direct all aspects of client development and direction, ensuring client satisfaction with project deliverables</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Your Qualifications:</strong></p><ul style=\"\"><li style=\"\"><p style=\"min-height:1.5em\">Minimum of 10 years of analytics and reporting experience, with a background in pharmaceutical and digital marketing (combination of client and agency experience preferred)</p></li><li style=\"\"><p style=\"min-height:1.5em\">Expertise with Tableau and programming languages like SQL</p></li><li style=\"\"><p style=\"min-height:1.5em\">Familiarity with syndicated data sources (e.g., IQVIA, claims data, etc.)</p></li><li style=\"\"><p style=\"min-height:1.5em\">Understanding of and experience using analytical concepts and statistical techniques: hypothesis development, designing tests/experiments, analyzing data, drawing conclusions, and developing actionable recommendations</p></li><li style=\"\"><p style=\"min-height:1.5em\">Working knowledge of data mining principles: predictive analytics, mapping, collecting data from multiple data systems on premises and cloud-based data sources</p><p style=\"min-height:1.5em\"></p></li></ul><p style=\"min-height:1.5em\"><strong>Benefits:</strong></p><ul style=\"\"><li style=\"\"><p style=\"min-height:1.5em\">Remote-first team environment</p></li><li style=\"\"><p style=\"min-height:1.5em\">Coverage for medical, dental, and vision insurance for you and your dependents</p></li><li style=\"\"><p style=\"min-height:1.5em\">Disability insurance plan </p></li><li style=\"\"><p style=\"min-height:1.5em\">Matching 401K </p></li><li style=\"\"><p style=\"min-height:1.5em\">Parental leave </p></li><li style=\"\"><p style=\"min-height:1.5em\">Other fun health &amp; wellness perks</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Spring &amp; Bond is an equal opportunity employer. All applicants will be considered for employment without attention to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran or disability status.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Spring &amp; Bond is a woman-owned business.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><em>Not everyone will match the above qualifications 100%. If your experiences don’t perfectly align, but you think you’d be a great addition to our team, we’d still love to hear from you.</em></p><img src=\"https://remotive.com/job/track/1992793/blank.gif?source=public_api\" alt=\"\"/>"
  },
  {
    "id": 1992706,
    "url": "https://remotive.com/remote-jobs/writing/direct-response-copywriter-1992706",
    "title": "Direct Response Copywriter",
    "company_name": "Petlab Co.",
    "company_logo": "https://remotive.com/job/1992706/logo",
    "category": "Writing",
    "tags": [
      "amazon",
      "video",
      "research",
      "customer acquisition",
      "analytics",
      "editing",
      "video editing",
      "testing",
      "diversity",
      "travel"
    ],
    "job_type": "full_time",
    "publication_date": "2025-04-06T18:51:01",
    "candidate_required_location": "UK",
    "salary": "",
    "description": "<p><strong>Title:  Direct Response Copywriter</strong></p><p><strong>Location: UK Remote (With monthly travel to our central London Office)</strong></p><p><strong>Position: Perm</strong></p><p></p><p><strong>About PetLab Co</strong></p><p>PetLab Co is the world leader in the DTC pet supplement market with 50%+ market share, 9-figure revenue, profitable and rapidly growing with ambitious plans for expansion. We’re searching for a results-driven direct response copywriter to join our team and help us scale to new heights.  </p><p>You’ll take full ownership of a key SKU, driving its revenue growth through innovative testing and optimization. Working closely with our video editing and media buying teams, you’ll create, refine, and iterate on new short-form video ad creatives and funnels.</p><p>We rigorously test our short-form ads and optimize them based on data. It often takes multiple iterations before an ad truly hits its stride. Hence, you should be persistent, fascinated by consumer behaviour, and well-versed in conversion rate optimization. So, if you live and breathe persuasive copywriting, are excited about a new challenge in a unique market, have a knack for creating compelling problem/solution copy that gets results…</p><p>… then please keep reading as you may be the perfect fit.<br> <br> <strong>Who Will You Report Into?</strong></p><p>Hi, I’m Tom Kruszewski, Head of Copy at PetLab Co,  and I need your help. PetLab Co. was started in 2018 because we saw an unmet need to offer safe, effective nutritional supplements to help pets have their happiest, healthiest lives.  Since then, we’ve become the fastest-growing pet health brand in the U.S., thanks in part to our rigorous scientific approach to customer acquisition and conversion and our focus on building a robust subscription business.</p><p>We’ve become very good at ad creative, building an in-house video &amp; copy creative team that delivers 1,100+ new customers a day on paid social platforms. This year, we will be expanding our product range and focus, which is where you come in.</p><p>We’re confident that with another talented direct response copywriter on the team, we can test and crack more angles faster, and significantly grow our customer acquisition volume. Your work will be front and centre across our platforms, fuelling our growth while helping us stay true to our mission of creating happier, healthier lives for pets everywhere.</p><p> </p><p><strong>What’s the Ideal Candidate’s Background?</strong></p><p>The ideal candidate is a direct response copywriter who can seamlessly shift between punchy, high-impact short-form video scripts and longer-form presell advertorial copy. You love digging into data, analysing the results of each test, brainstorming new angles, and going back to the drawing board until you find “the one.” You’re a master at hooking attention quickly and know how to tell a gripping story in seconds.</p><p>More importantly, you’re addicted to consumer psychology, love designing experiments, have high empathy for consumers, and come alive at crafting strategy. You thrive in a fast-paced environment, love rolling up your sleeves to produce copy at scale, and know how to speak directly to our target customers’ deepest desires and pain points.</p><p>You’ll flourish in a team environment with other high-caliber creatives, sharing insights, brainstorming fresh hypotheses, and collaborating to continuously refine our approach. Ultimately, you’re laser-focused on discovering the type of messaging that resonates so powerfully, viewers can’t help but click.</p><p> </p><p><strong>What’s It Like Working at PetLab Co.?</strong></p><p>We’ve gone to great lengths to set up a data-driven culture wherein the best ideas win, regardless of where they come from.  As a rapidly growing company, we prioritize finding people who can think fast, move fast and deliver fast… while having fun at the same time.</p><p>To that end, here’s what you’ll get access to when you join our team:</p><ul style=\"\"> <li style=\"\">Clear Reporting – Getting accurate and timely data is crucial to enabling marketers to do their jobs, which is precisely what our standalone data analytics team delivers</li> <li style=\"\">Collaborative Team – There are no silos here, we all understand that to win, we must help each other out as necessary, doing things outside our normal jobs when needed</li> <li style=\"\">Scientific Rigor – Everyone on the marketing team shares the same philosophy to attack every challenge with an experimental test-and-learn process to tease out success</li> <li style=\"\">Variety of Challenges – Given we’re just entering our 5th year as a company and growing rapidly, the challenges keep coming with new products, promotions, categories, etc.</li> <li style=\"\">Refreshing Autonomy – Expectations are always set high for anybody who joins the team, but so too is your autonomy to figure out how best to deliver against your objectives</li> </ul><p>You’ll also find that everyone here listens – if something isn’t working, we respectfully call it out.  If something is needed, those needs are heard.  If there’s something we can do better, let’s hear it.</p><p><strong>Requirements</strong></p><ul style=\"\"> <li style=\"\"> <strong>3-5 Years Direct Response Copywriting</strong> – Hands-on creation of high-performing short-form video ad scripts and presell advertorials for paid social in a fast-paced environment.</li> <li style=\"\"> <strong>Consumer-Oriented</strong> – Strong empathy for consumers, deep understanding of psychology, and excellent research skills to identify those big-idea concepts that capture attention fast.</li> <li style=\"\"> <strong>Data-Driven</strong> – Extremely comfortable flexing your analytical side, dissecting performance metrics, and iterating fast to improve conversions.</li> <li style=\"\"> <strong>Systems-Oriented</strong> – Highly organized with repeatable processes that help you efficiently launch multiple concepts at once.</li> <li style=\"\"> <strong>Exceptional Communication</strong> – Able to quickly synthesize info and articulate clear strategies, verbally and in writing, for your creative team.</li> <li style=\"\"> <strong>Proven Success</strong> – Demonstrable, measurable success in scaling short-form direct response campaigns – whether for in-house brands or agency clients.</li> <li style=\"\"> <strong>Direct Response Marketer</strong> – You know how to pinpoint an opportunity, devise a strategy, build a plan, and deliver success. You understand the interplay between problem, solution, and the unique mechanism that makes a product stand out.</li> <li style=\"\"> <strong>Robust Test Architect</strong> – Capable of defining test parameters (audience, sample size, and creative variable) and executing them systematically until you find the winning formula.</li> <li style=\"\"> <strong>Think Fast, Move Fast</strong> – Energized by a high-velocity, high-growth entrepreneurial environment with loads of new angles and campaigns to test.</li> <li style=\"\"> <strong>Driven to Excellence</strong> – Possess a relentless inner drive to deliver excellence in every project, from concept to final cut.</li> </ul><p><strong>Benefits</strong></p><p><strong>The Good Stuff…</strong></p><ul style=\"\"> <li style=\"\">Generous Annual Leave - 28 days + public and bank holidays</li> <li style=\"\">Bonus- based on performance and paid out April and October</li> <li style=\"\">Flexible Working Hours – We focus on results and trust people to manage their time, whether working from home, while traveling, or in the office!</li> <li style=\"\">Company Equipment – Laptop issued to you so you're all set from day 1.</li> <li style=\"\">Get Your Read On – We love to promote and encourage personal &amp; professional development so we couldn't be happier to buy books of your choice via amazon or pay for audible subscription.</li> <li style=\"\">Employee Assistance Programme.</li> <li style=\"\">Pension Scheme – contributions towards your pension scheme!</li> <li style=\"\">Enhanced Maternity / Paternity / Adoption Leave – because time with new family members is important!</li> <li style=\"\">Puppy Therapy – working in partnership with Paws in Work to provide a boost of oxytocin every quarter.</li> <li style=\"\">Cycle2Work Scheme – Government initiative which offers a cost-effective way to buy new cycling equipment.</li> <li style=\"\">Discount Vouchers &amp; Gym Memberships – get discounts at a whole range of retailers and gym memberships through our provider, Sodexo.</li> <li style=\"\">Free breakfast, fruits and snacks – refuel and revitalise with free munchies in the office.</li> <li style=\"\">Environment – dogs are welcome!</li> </ul><p>Petlab Co is an equal opportunity employer that is committed to diversity and inclusion. We encourage all applications irrespective of gender, race, sexual orientation, religion, age, nationality, marital status, and disability. We believe that diversity is at the heart of innovation and we welcome passionate candidates form all backgrounds. Come join the family and see for yourself!</p><br><br><div class=\"h2\">About the company</div><br><p>Petlab Co. is the world’s fastest-growing pet supplement business. Launching in December 2018,PetLab Co. has a loyal community of over 100,000+ pets and owners, who have had their lives positively impacted by innovative Petlab Co. products. Petlab Co. is a vibrant, fast-moving, and customer-centric team who value and reward high-performing players. It is an ideal place for a candidate who is ambitious, hardworking, loves animals, is looking to rapidly progress their career, and would enjoy working in a vibrant environment with smart co-workers and friendly office dogs! With a currently strong foothold in the United States, in the next several years, the Company intends to rapidly establish a presence across Europe and Asia. This exciting growth/hyper-scale will be underpinned by a continually evolving bedrock of proprietary product formulations that will improve pet and owner lives. Finally, the Company intends to continue to grow the value-add services and innovative products it provides to its enthusiastic community.<br></p><img src=\"https://remotive.com/job/track/1992706/blank.gif?source=public_api\" alt=\"\"/>"
  },
  {
    "id": 1992354,
    "url": "https://remotive.com/remote-jobs/project-management/project-owner-1992354",
    "title": "Project Owner",
    "company_name": "Capital Technology Group",
    "company_logo": "https://remotive.com/job/1992354/logo",
    "category": "Project Management",
    "tags": [
      "team management"
    ],
    "job_type": "full_time",
    "publication_date": "2025-04-06T16:50:46",
    "candidate_required_location": "USA",
    "salary": "$110k to $140k annually",
    "description": "<div class='\"content-intro\"'><p><img alt='\"\"' class='\"image-9\"' height='\"90\"' src=\"%22https://cdn.prod.website-files.com/674df1e2b64446144d53d899/674df20b2bc1cd3f0e0fa1a5_CTG Logo.svg%22\" style='\"display:' width='\"150\"'></p>\n<p style='\"text-align:'><strong>Capital Technology Group provides expert consulting services software development, digital transformation, human-centered design, data analytics and visualization, and cybersecurity. </strong></p>\n<p style='\"text-align:'>Our multidisciplinary teams use agile methodologies to rapidly and incrementally deliver value in close collaboration with our clients. For over a decade, we have been trusted by both federal and commercial clients to solve complex, mission-critical business challenges. The quality of our work has been recognized by our partners and peers through our inclusion in the Digital Services Coalition, a group of forward- thinking firms recognized for excellence in delivering IT services.</p></div><div class='\"styles--2BkR3\"'>\n<div class='\"styles--2BkR3\"'>\n<div class=\"h4\">Description</div>\n<p><em>Capital Technology Group</em> (CTG) is on a mission to modernize and innovate the way the federal government delivers software. We are passionate about our work, dedicated to our clients, and committed to a culture of continuous learning and growth. For this role specifically, we are seeking individuals to help support high-impact, civic tech within the federal government.</p>\n<p>We are currently seeking a Project Owner to join our team! The Project Owner analyzes user needs to determine functional and nonfunctional requirements. Performs group facilitation, interviewing, and training. Assists more experienced business analysts in preparing the project deliverables and guides work of more junior analysts. Provides support by coordinating with other project teams during user acceptance testing, training and production deployment activities. Serves as Scrum Master during Agile software development projects. The Project Owner will facilitate team productivity by removing any blockers that may obstruct the pursuit of the team's goals and by preserving flexibility and the adaptability of the team.</p>\n<strong>Client Requirements: </strong>applicants <strong>MUST BE US Citizens </strong>and<strong> </strong>able to obtain Public Trust clearance\n<div>\n<div class=\"h4\">Responsibilities</div>\n<ul style=\"\">\n<li style=\"\">Facilitate Agile Scrum ceremonies like stand-ups, sprint planning, release planning, backlog refinement, and retrospective</li>\n<li style=\"\">Track and report team performance metrics</li>\n<li style=\"\">Experience coordinating and driving Agile projects</li>\n<li style=\"\">Ability to understand a project's technical details and uncover and assess project risks</li>\n<li style=\"\">Knowledge and understanding of web architecture, technologies, and applications</li>\n<li style=\"\">Ability to address, research, elevate, provide feedback, and resolve issues related to IT portfolio management</li>\n<li style=\"\">Ability to coach the team to improve collaboration and self-organization</li>\n</ul>\n</div>\n</div>\n<div class='\"styles--2kg4_\"'>\n<div class=\"h4\">Requirements</div>\n<ul style=\"\">\n<li style=\"\">Bachelor’s degree in a related field of study</li>\n<li style=\"\">At least 7 years of experience</li>\n<li style=\"\">Strong communication and team management skills</li>\n</ul>\n<p><strong>Nice to Have:</strong></p>\n<ul style=\"\">\n<li style=\"\">Scrum Alliance CSM or CSP certification or PMI’s Agile Certified Professional (ACP)</li>\n<li style=\"\">PMP, Lean, Agile, or Six Sigma certification</li>\n<li style=\"\">SAFe certified or experience (or other scaled agile frameworks)</li>\n</ul>\n<p><strong>Salary Information</strong></p>\n<p>We are committed to offering a competitive salary for this position, with an estimated range of $110k to $140k annually. Please note that this range is intended to provide a general idea of what to expect. The final offer may vary based on experience, skills, and other factor</p>\n</div>\n</div><div class='\"content-conclusion\"'><div class='\"styles--21mG1\"'>\n<div class=\"h4\">Full Time Employee Benefits</div>\n<div>\n<ul style=\"\">\n<li style=\"\">Remote Work <em>(Hybrid roles will be specified in the job post)</em></li>\n<li style=\"\">Competitive Compensation Package</li>\n<li style=\"\">Medical, Dental, and Vision</li>\n<li style=\"\">Life Insurance, Short/Long Term Disability</li>\n<li style=\"\">Employee Assistance Program</li>\n<li style=\"\">401(k) with 4% matching</li>\n<li style=\"\">Liberal PTO vacation policy</li>\n<li style=\"\">Generous Annual Continuing Education</li>\n<li style=\"\">Annual Wellness Budget</li>\n<li style=\"\">Bonus Incentive Programs <em>(Employee referrals and performance-based rewards)</em></li>\n</ul>\n<p style='\"text-align:'><strong>Thanks for your interest in Capital Technology Group!</strong></p>\n<p style='\"text-align:'><em>Capital Technology Group is an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, or any other characteristic protected by law.</em></p>\n</div>\n</div>\n<p> </p></div><img src=\"https://remotive.com/job/track/1992354/blank.gif?source=public_api\" alt=\"\"/>"
  },
  {
    "id": 1992196,
    "url": "https://remotive.com/remote-jobs/sales-business/lead-generation-specialist-1992196",
    "title": "Lead Generation Specialist",
    "company_name": "VirtuHire",
    "company_logo": "https://remotive.com/job/1992196/logo",
    "category": "Sales / Business",
    "tags": [
      "business development",
      "lead generation"
    ],
    "job_type": "full_time",
    "publication_date": "2025-04-06T16:50:41",
    "candidate_required_location": "South Africa",
    "salary": "",
    "description": "<p>As a <strong>Lead Generation Specialist</strong>, you will play a crucial role in driving business growth by identifying and engaging potential clients in the IT sector. This role requires <strong>strong LinkedIn business development skills and cold calling expertise</strong> to build relationships with key decision-makers and generate new business opportunities for the recruitment team.</p><p><strong>Key Responsibilities</strong></p><ul style=\"\"> <li style=\"\">Research and identify prospective clients within the IT industry.</li> <li style=\"\"> <strong>Leverage LinkedIn Sales Navigator and other tools</strong> to connect with potential clients.</li> <li style=\"\">Develop and execute targeted outreach campaigns via <strong>LinkedIn, email, and cold calls</strong>.</li> <li style=\"\">Build and maintain a strong pipeline of qualified leads.</li> <li style=\"\">Collaborate with the recruitment team to understand hiring needs and market trends.</li> <li style=\"\">Nurture relationships with potential clients to convert leads into long-term partnerships.</li> <li style=\"\">Track and report lead generation activities and outcomes.</li> </ul><p><strong>Requirements</strong></p><p></p><ul style=\"\"> <li style=\"\">Proven experience in <strong>lead generation, business development, or sales</strong>, ideally within the IT or recruitment sector.</li> <li style=\"\">Strong experience in <strong>LinkedIn outreach and cold calling</strong>.</li> <li style=\"\">Excellent communication and interpersonal skills.</li> <li style=\"\">Proactive, results-driven mindset with the ability to work independently.</li> <li style=\"\">Experience using <strong>CRM tools and LinkedIn Sales Navigator</strong> (preferred).</li> </ul><br><br><div class=\"h2\">About the company</div><br><p><strong>VirtuHire</strong></p><p>At VirtuHire, we specialize in connecting businesses with South Africa's top-tier remote talent. By offering no-recruitment-fee hiring solutions and acting as the Employer of Record (EOR), we handle everything from sourcing and onboarding to payroll and admin management. Our mission is to empower companies to scale efficiently, save up to 68% on operational costs, and access a highly skilled, diverse workforce tailored to their needs.</p><p>Whether you're a business looking for cost-effective, qualified talent or an applicant seeking exciting remote opportunities, VirtuHire ensures a seamless and professional experience at every step. Join us and discover the difference of working with the top 1%.</p><img src=\"https://remotive.com/job/track/1992196/blank.gif?source=public_api\" alt=\"\"/>"
  },
  {
    "id": 1992441,
    "url": "https://remotive.com/remote-jobs/design/designer-1992441",
    "title": "Designer",
    "company_name": "Precisionaq",
    "company_logo": "https://remotive.com/job/1992441/logo",
    "category": "Design",
    "tags": [
      "Figma",
      "graphic design",
      "microsoft office"
    ],
    "job_type": "full_time",
    "publication_date": "2025-04-06T16:50:34",
    "candidate_required_location": "USA",
    "salary": "$60,000 - $78,000 usd",
    "description": "<p><strong>Designer</strong></p>\n<p>Produce quality communication vehicles. Electronically design print and digital materials in a creative, innovative, and cost-effective manor, while exceeding the expectations of all our internal and external customers</p>\n<p><strong>Essential Functions:</strong></p>\n<p><strong>Design</strong></p>\n<ul style=\"\">\n<li style=\"\">Design in a range of visual styles as appropriate for different clients and mediums</li>\n<li style=\"\">Flow and re-flow layout, resizing art, version campaigning, concept and logo execution, and create PPT presentations that are clean, engaging and dynamic</li>\n<li style=\"\">Design and produce print and digital pieces that align with branding guidelines</li>\n<li style=\"\">Research and develop conceptual graphic design and/or illustration for assigned projects and submit to Creative Director for internal review; submit final to Project Management for proofing</li>\n<li style=\"\">Consult with the Associate Creative Director or Creative Director to evaluate specifications for individual project needs</li>\n<li style=\"\">Consult with Project Management and other agency team members as necessary to confirm/establish timing, due dates, and production specifications</li>\n</ul>\n<p><strong>Concepting</strong></p>\n<ul style=\"\">\n<li style=\"\">Assist in the design of an established concept as needed</li>\n<li style=\"\">Work with the art directors to help bring a concept to life</li>\n<li style=\"\">Demonstrate an understanding of a creative concept to ensure the design solves are purposeful and thoughtful</li>\n</ul>\n<p><strong>Presenting</strong></p>\n<ul style=\"\">\n<li style=\"\">Present the tactics to the internal team</li>\n</ul>\n<p><strong>Team Interaction/Management</strong></p>\n<ul style=\"\">\n<li style=\"\">Attend Creative and Production meetings</li>\n<li style=\"\">Archive completed projects to appropriate media</li>\n<li style=\"\">Assist with related special projects as needed</li>\n</ul>\n<p><strong>Product and Content</strong></p>\n<ul style=\"\">\n<li style=\"\">Thoroughly understand product category and competitors, as well as key data sets</li>\n</ul>\n<p><strong>Strategy</strong></p>\n<ul style=\"\">\n<li style=\"\">Remain focused on details, but take initiative in building understanding of bigger picture of clients’ objectives and initiatives</li>\n</ul>\n<p><strong>Qualifications</strong></p>\n<p>Minimum Education: Bachelor’s degree required, in design, preferred, and appropriate portfolio</p>\n<p>Minimum Required Work Experience:</p>\n<p>3+ years graphic design experience in a design studio or advertising or marketing agency</p>\n<p>Other Requirements (e.g. Skills):</p>\n<ul style=\"\">\n<li style=\"\">Understanding of color theory, typography, and visual communication principles—such as logo design best practices, layout creation, and design for print and web</li>\n<li style=\"\">Knowledge of infographic design and basic data visualization</li>\n<li style=\"\">Proficiency of Adobe CS (InDesign, Illustrator, Photoshop, XD, Acrobat)</li>\n<li style=\"\">Proficiency of Figma</li>\n<li style=\"\">Proficiency of Microsoft Office, including PowerPoint</li>\n<li style=\"\">Proficiency in Mac OS</li>\n</ul>\n<p>Competencies:</p>\n<ul style=\"\">\n<li style=\"\">Ability to multi-task and prioritize deadline-sensitive projects</li>\n<li style=\"\">Self-Starting</li>\n<li style=\"\">Teamwork</li>\n<li style=\"\">Collaborative</li>\n<li style=\"\">Adaptive</li>\n<li style=\"\">Communication</li>\n<li style=\"\">Problem Solving</li>\n<li style=\"\">Confident</li>\n</ul>\n<p>#LI-Remote</p><div class='\"content-pay-transparency\"'><div class='\"pay-input\"'><div class='\"description\"'>Precision is required by law in some states or cities to include a reasonable estimate of the compensation range for this role. This compensation range takes into account the wide range of factors that are considered in making compensation decisions including but not limited to: skill sets, experience and training, licensure and certifications, and other business and organizational needs. The disclosed range estimate has not been adjusted for the applicable geographic differential associated with the location at which the position may be filled. At Precision, it is not typical for an individual to be hired at or near the top of the range for their role and compensation decisions are dependent on the facts and circumstances of each case. This role is also eligible for a discretionary annual bonus, health insurance, retirement savings benefits, life insurance and disability benefits, parental leave, and paid time off for sick leave and vacation, among other benefits.</div><div class='\"title\"'>Reasonable estimate of the current range</div><div class='\"pay-range\"'><span>$60,000</span><span class='\"divider\"'>—</span><span>$78,000 USD</span></div></div></div><div class='\"content-conclusion\"'><p>Any data provided as a part of this application will be stored in accordance with our <a href=\"%22https://nam12.safelinks.protection.outlook.com/?url=https%3A%2F%2Fwww.precisionmedicinegrp.com%2Fprivacy-policy%2F&amp;data=05|01|zeta.larcon%40precisionmedicinegrp.com|b58fe8b0c3ea4dd2e79d08db5bd09a25|b71ff3f628164ca8a9b938f820f91ad1|0|0|638204723732367131|Unknown|TWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D|3000|||&amp;sdata=9DgboiHTFPrNYVhdKhyfdwVyNYwUvZbP%2FroLdWIIfxw%3D&amp;reserved=0%22\" rel=\"nofollow\" target='\"_blank\"'>Privacy Policy.</a> For CA applicants, please also refer to our <a href=\"%22https://nam12.safelinks.protection.outlook.com/?url=https%3A%2F%2Fwww.precisionmedicinegrp.com%2Fca-applicants-privacy-notice%2F&amp;data=05|01|zeta.larcon%40precisionmedicinegrp.com|b58fe8b0c3ea4dd2e79d08db5bd09a25|b71ff3f628164ca8a9b938f820f91ad1|0|0|638204723732367131|Unknown|TWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D|3000|||&amp;sdata=tfAqqMZsG%2B11IchL45HFFVbfECCkYqQpNr0PQxrMFJU%3D&amp;reserved=0%22\" rel=\"nofollow\" target='\"_blank\"'>CA Privacy Notice</a>.</p>\n<p>Precision Medicine Group is an Equal Opportunity Employer. Employment decisions are made without regard to race, color, age, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status or other characteristics protected by law. © 2020 Precision Medicine Group, LLC</p>\n<p>If you are an individual with a disability and require a reasonable accommodation to complete any part of the application process or are limited in the ability or unable to access or use this online application process and need an alternative method for applying, you may contact Precision Medicine Group at <a href=\"%22mailto:QuestionForHR@precisionmedicinegrp.com%22\" rel=\"nofollow\">QuestionForHR@precisionmedicinegrp.com</a>.</p>\n<p>It has come to our attention that some individuals or organizations are reaching out to job seekers and posing as potential employers presenting enticing employment offers. We want to emphasize that these offers are not associated with our company and may be fraudulent in nature. Please note that our organization will not extend a job offer without prior communication with our recruiting team, hiring managers and a formal interview process.</p></div><img src=\"https://remotive.com/job/track/1992441/blank.gif?source=public_api\" alt=\"\"/>"
  },
  {
    "id": 1992443,
    "url": "https://remotive.com/remote-jobs/design/senior-director-of-design-1992443",
    "title": "Senior Director of Design",
    "company_name": "QuillBot",
    "company_logo": "https://remotive.com/job/1992443/logo",
    "category": "Design",
    "tags": [
      "Figma"
    ],
    "job_type": "full_time",
    "publication_date": "2025-04-06T16:50:33",
    "candidate_required_location": "Germany, Netherlands",
    "salary": "€134,000 - €182,000 eur",
    "description": "<p><strong>About Us<br></strong>QuillBot is developing state-of-the-art AI technology to make writing painless. We were founded on the belief that learning and applying knowledge are more rewarding than the mundane aspects of writing. The QuillBot team seeks to continue that mission, automating those tasks and allowing you to focus on what you write, not how you should write it. Transforming the way you write. <br><br><strong>Overview of the Role</strong><br>We are looking for a <strong>Senior Director of Design</strong> to lead the product design function at QuillBot. This role is for a strong operator—someone who can build systems, set expectations, and provide the clarity designers need to thrive in a fast-moving, high-growth environment.<br><br>You will be responsible for evolving our design process in partnership with Product and Engineering, and for leading performance management, hiring, and professional development across the design team. You’ll manage a team of design managers and functional leads, partnering cross-functionally to support planning, execution, and team growth.<br><br>Ideal candidates bring experience with complex, multi-surface B2C products, and have led scaled, distributed design teams across multiple pods. You understand how to maintain cohesion and collaboration across surfaces and time zones, and you lead with empathy—resolving friction, fostering strong partnerships, and building the cross-functional chemistry needed to deliver great work.<br><br><strong>Responsibilities:<br></strong></p>\n<ul style=\"\">\n<li style=\"\">Lead the product design function, managing a team of Design Managers and the Design System Lead</li>\n<li style=\"\">Design, implement, and continuously improve a high-functioning design process optimized for collaboration, speed, and quality</li>\n<li style=\"\">Define and track key execution and design metrics to guide strategic decisions and demonstrate impact</li>\n<li style=\"\">Ensure design workflows are predictable, scalable, and integrated with our product operating model across pods and workstreams</li>\n<li style=\"\">Build strong cross-functional partnerships with Product, AI, and Engineering grounded in shared accountability and operational clarity</li>\n<li style=\"\">Actively surface and resolve friction between functions, helping teams align quickly and maintain healthy partnerships</li>\n<li style=\"\">Establish clear performance expectations, career paths, and growth frameworks for the product design team</li>\n<li style=\"\">Partner with product leadership on quarterly planning and cross-workstream prioritization</li>\n<li style=\"\">Collaborate with the Design System Lead to evolve and maintain a cohesive design system</li>\n<li style=\"\">Guide the design team in building intuitive, inclusive, and user-centered experiences that drive business outcomes</li>\n<li style=\"\">Represent the design function at the leadership level, ensuring design has a seat at the table in strategic conversations</li>\n</ul>\n<p><strong>Qualifications: </strong></p>\n<ul style=\"\">\n<li style=\"\">12+ years of experience in product/UX design, with 7+ years in leadership roles</li>\n<li style=\"\">Consistent track record of effectively managing both ICs and managers</li>\n<li style=\"\">Experience leading product design for complex software products</li>\n<li style=\"\">Background in B2C environments, ideally in fast-moving, high-growth companies</li>\n<li style=\"\">Deep experience building and evolving strong Agile UX design operations, systems, and performance frameworks at scale</li>\n<li style=\"\">Demonstrated success in scaling and managing multi-pod design teams, including remote and distributed team structures</li>\n<li style=\"\">Proven ability to drive cross-functional alignment and navigate complex team dynamics with empathy and decisiveness</li>\n<li style=\"\">Deep proficiency with Figma and common Design System frameworks (e.g., Storybook, MUI) </li>\n<li style=\"\">Strong plus: experience designing for global userbases or non-English markets</li>\n<li style=\"\">Strong plus: experience designing for desktop/mobile applications or browser extensions</li>\n<li style=\"\">Strong plus: experience designing AI-powered user experiences or systems</li>\n<li style=\"\">Strong plus: experience with clickstream analytics tools (e.g., Amplitude, GA4)</li>\n</ul>\n<p><strong>Benefits &amp; Perks:</strong></p>\n<ul style=\"\">\n<li style=\"\">Competitive salary &amp; annual bonus</li>\n<li style=\"\">Retirement Savings Plans</li>\n<li style=\"\">Vacation &amp; leaves of absence</li>\n<li style=\"\">Developmental opportunities through education &amp; developmental reimbursements &amp; professional workshops</li>\n<li style=\"\">Maternity &amp; parental leave</li>\n<li style=\"\">Hybrid &amp; remote model with flexible working hours</li>\n<li style=\"\">On-site &amp; remote company events throughout the year</li>\n<li style=\"\">Wellness initiatives through stipend or ClassPass memberships depending on region</li>\n<li style=\"\">Tech &amp; WFH set-up</li>\n<li style=\"\">Employee referral program</li>\n<li style=\"\">Premium access to QuillBot &amp; LanguageTooler</li>\n</ul>\n<p>*Benefits and benefit amounts differ by region. A comprehensive list applicable to your region will be provided in your interview process.</p>\n<p>Research shows that candidates from underrepresented backgrounds often don't apply for roles if they don't meet all the criteria. We strongly encourage you to apply if you're interested: we'd love to learn how you can amplify our team with your unique experience!<br><br>This role is eligible for hire in Germany &amp; Netherlands. <br><br>We are a virtual-first company and have employees dispersed throughout the United States, Canada, Germany, Netherlands, and India. We have a market-based pay structure that varies by location. The base pay for this position is dependent on multiple factors, including candidate experience and expertise, and may vary from the amounts listed below. You may also be eligible to participate in our bonus program and may be offered an equity award, benefits, and other types of compensation.<br><br>#QuillBot<br>#LI-Remote<br>#LI-MG1<br>#Germany</p><div class='\"content-pay-transparency\"'><div class='\"pay-input\"'><div class='\"description\"'><table class='\"sc-gnpbhQ'>\n<tbody class='\"sc-dnaUSb'>\n<tr class='\"sc-la-DxNn'>\n<td class='\"sc-knesRu'>\n<p class='\"internal-typography__ListViewSecondaryCell-kSRduU'>In accordance with Dutch law, the base salary for this role if filled within Netherlands is as follows.</p>\n</td>\n<td class='\"sc-knesRu'> </td>\n</tr>\n</tbody>\n</table>\n<p> </p></div><div class='\"title\"'>Netherlands Pay Range</div><div class='\"pay-range\"'><span>€134.000</span><span class='\"divider\"'>—</span><span>€182.000 EUR</span></div></div><div class='\"pay-input\"'><div class='\"description\"'><table class='\"sc-gnpbhQ'>\n<tbody class='\"sc-dnaUSb'>\n<tr class='\"sc-la-DxNn'>\n<td class='\"sc-knesRu'>\n<p class='\"internal-typography__ListViewSecondaryCell-kSRduU'>In accordance with German law, the base salary for this role if filled within Germany is as follows.</p>\n</td>\n<td class='\"sc-knesRu'> </td>\n</tr>\n</tbody>\n</table>\n<p> </p></div><div class='\"title\"'>Germany Pay Range</div><div class='\"pay-range\"'><span>€134.000</span><span class='\"divider\"'>—</span><span>€182.000 EUR</span></div></div></div><div class='\"content-conclusion\"'><p class='\"p1\"'><strong>Equal ​Employment Opportunity Statement ​(EEO)</strong></p>\n<p class='\"p1\"'>We are an equal opportunity employer and value diversity and ​inclusion within our company.<span class='\"Apple-converted-space\"'>  </span>​We will consider all qualified applicants without regard to race, religion, color, national origin, sex, gender ​identity, gender expression, sexual orientation, age, marital status, ​veteran status, or ​ability status. We will ensure that individuals who are differently abled are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment as provided to other applicants or employees. Please contact us to request accommodation.</p></div><img src=\"https://remotive.com/job/track/1992443/blank.gif?source=public_api\" alt=\"\"/>"
  },
  {
    "id": 1992155,
    "url": "https://remotive.com/remote-jobs/software-dev/drupal-developer-1992155",
    "title": "Drupal Developer",
    "company_name": "Dynamo Technologies",
    "company_logo": "https://remotive.com/job/1992155/logo",
    "category": "Software Development",
    "tags": [
      "javascript",
      "php"
    ],
    "job_type": "full_time",
    "publication_date": "2025-04-06T16:50:28",
    "candidate_required_location": "USA",
    "salary": "$125,000 - $135,000 usd",
    "description": "<p><strong>Job Description:</strong></p>\n<p>Dynamo Technologies LLC is currently seeking a Drupal Developer to support our The U.S. Forest Service (FS) client. This project will support website modernization and Operations and Maintenance (O&amp;M) using agile development.</p>\n<p><strong>Duties/ Responsibilities </strong></p>\n<ul style=\"\">\n<li style=\"\">Maintain and update existing websites and web applications functionality including but not limited to Agency public-facing and internal facing Drupal/PHP CMS and legacy static/PHP websites.</li>\n<li style=\"\">Develop and maintain Forest Service Agency public-facing websites using various web technologies, to include but not limited to Drupal versions 9, 10 and above CMS websites, based on the USDA Digital Strategy Playbook and U.S. Web Design System, and comply with the 21st Century Integrated Digital Experience Act (https://digital.gov/resources/21stcentury-integrated-digital-experience-act/).</li>\n<li style=\"\">Deploy Agency websites in a centralized, large-scale environment and within an architecture that easily facilitates the management of common theme(s), modules or other shared components for large scale and/or standalone websites.</li>\n<li style=\"\">Design, develop, test, migrate and maintain the implementation of existing Forest Service public-facing and internal-facing web sites and web applications and web components some of which may be currently hosted on external partner domains.</li>\n<li style=\"\">Integrate and maintain websites and web applications and systems with other internal and external applications, tools and databases.</li>\n<li style=\"\">Use Agency approved and specified GitHub repository to store source code, document code, release packages, and associated artifacts.</li>\n<li style=\"\">Oversee development activities for project and provide upwards reporting to the Program Manager.</li>\n<li style=\"\">Write clean and efficient code, following best practices and coding standards.</li>\n<li style=\"\">Support new projects and tasks for software development projects as requested by the government.</li>\n</ul>\n<p><strong>Required Skills/Abilities</strong></p>\n<ul style=\"\">\n<li style=\"\">Expertise in Drupal 9/10 development.</li>\n<li style=\"\">Experienced with custom module and theme development.</li>\n<li style=\"\">Strong PHP development experience.</li>\n<li style=\"\">Front-end expertise – Experience with Twig, HTML5, CSS3, JavaScript, and frameworks.</li>\n<li style=\"\">Database management – Proficiency with MySQL/MariaDB and familiarity with database optimization.</li>\n<li style=\"\">Experience with Drupal API and integrations.</li>\n<li style=\"\">Strong understanding of Composer and Drush.</li>\n<li style=\"\">Security best practices – Familiarity with Drupal security standards and OWASP guidelines.</li>\n<li style=\"\">Ability to architect enterprise Drupal solutions including data, display, and information architecture.</li>\n<li style=\"\">Strong understanding of performance optimization, caching strategies. and page speed improvements.</li>\n<li style=\"\">Experience with CI/CD pipelines – Git, automated testing, and deployment workflows.</li>\n<li style=\"\">Excellent problem-solving and analytical skills.</li>\n<li style=\"\">Ability to work effectively both independently and in a team environment.</li>\n<li style=\"\">Strong communication and interpersonal skills.</li>\n<li style=\"\">Thorough understanding of the Software Development Lifecycle (e.g. Requirements, Design, Development, Testing and exposure to Agile or iterative SDLC).</li>\n<li style=\"\">U.S Citizenship required</li>\n</ul>\n<p><strong>Education and Experience:</strong></p>\n<ul style=\"\">\n<li style=\"\">\n<p>Bachelor of Science in IT, Software Engineering, or a related field (If no degree, then 11+ years of development experience is required).</p>\n</li>\n<li style=\"\">7+ years of development experience</li>\n</ul>\n<p><strong>Travel Requirement</strong><em>: </em></p>\n<ul style=\"\">\n<li style=\"\">Unlikely</li>\n</ul>\n<p><strong>Clearance Requirement:</strong></p>\n<ul style=\"\">\n<li style=\"\">Public Trust</li>\n</ul>\n<p>Dynamo is a full lifecycle digital transformation company providing best-in-class technology and mission support services to our clients. Dynamo’s mission is to lead the digital transformation industry and provide best-in-class solutions for our clients with a truly human touch. ​</p>\n<p>We leverage industry leading practices to empower our clients, ultimately providing them with the necessary tools, knowledge, and information required to successfully achieve their strategic goals, while optimizing their operations. ​</p>\n<p>Through our partnerships, boldness, and authenticity, Dynamo goes against the grain of a traditional government contracting company by providing top-caliber team members, delivering quality results, and always exceeding expectations.</p>\n<p>Dynamo Technologies is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to sex, gender identity, sexual orientation, race, color, religion, national origin, disability, protected Veteran status, age, or any other characteristic protected by law.</p><div class='\"content-pay-transparency\"'><div class='\"pay-input\"'><div class='\"title\"'>Remote Salary Range</div><div class='\"pay-range\"'><span>$125,000</span><span class='\"divider\"'>—</span><span>$135,000 USD</span></div></div></div><img src=\"https://remotive.com/job/track/1992155/blank.gif?source=public_api\" alt=\"\"/>"
  },
  {
    "id": 1992533,
    "url": "https://remotive.com/remote-jobs/customer-support/technical-support-engineer-1992533",
    "title": "Technical Support Engineer",
    "company_name": "Ping Identity",
    "company_logo": "https://remotive.com/job/1992533/logo",
    "category": "Customer Service",
    "tags": [
      "apache",
      "AWS",
      "azure",
      "cloud",
      "docker",
      "java",
      "javascript",
      "kubernetes",
      "security",
      "sql",
      "video",
      "product management",
      "documentation",
      "healthcare",
      "google cloud",
      "technical support",
      "cybersecurity",
      "SOLID",
      "startup",
      "scripting",
      "troubleshooting",
      "Linux/Unix",
      "ticketing",
      "JBoss",
      "testing",
      "infrastructure"
    ],
    "job_type": "full_time",
    "publication_date": "2025-04-06T14:50:17",
    "candidate_required_location": "UK",
    "salary": "",
    "description": "<div class='\"content-intro\"'><p><strong>About Ping Identity: </strong></p>\n<p>At Ping Identity, we believe in making digital experiences both secure and seamless for all users, without compromise. We call this digital freedom. And it's not just something we provide our customers. It's something that inspires our company. People don't come here to join a culture that's built on digital freedom. They come to cultivate it. </p>\n<p>Our intelligent, cloud identity platform lets people shop, work, bank, and interact wherever and however they want. Without friction. Without fear. </p>\n<p>While protecting digital identities is at the core of our technology, protecting individual identities is at the core of our culture. <a href=\"%22https://www.pingidentity.com/en/company/championing-every-identity.html%22\" rel=\"nofollow\">We champion every identity.</a> One of our core values, Respect Individuality, reminds us to celebrate differences so you are empowered to bring your authentic self to work. </p>\n<p>We're headquartered in Denver, Colorado and we have offices and employees around the globe. We serve the largest, most demanding enterprises worldwide, including more than half of the Fortune 100. At Ping Identity, we're changing the way people and businesses think about cybersecurity, digital experiences, and identity and access management. </p></div><p>As a Support Engineer, you will be working in a customer-facing capacity, helping to ensure they have a seamless experience using our products and navigating any issues that arise. Additionally, you will help the resolution of any problems that may arise, working cross-functionally internally to quickly come up with the most efficient solution to ensure customers have a continuous operation of our products.</p>\n<p><strong>Main Responsibilities:</strong></p>\n<ul style=\"\">\n<li style=\"\">Interacting with customers, responding in a professional and efficient manner, helping them identify and resolve technical issues. Showing a respect for all customers and team members at all times</li>\n<li style=\"\">Meeting or exceed customer expectations on response quality, timeliness and overall customer experience</li>\n<li style=\"\">Taking end-to-end ownership of assigned customer issues, including initial troubleshooting, identification of root cause and issue resolution. Showing dedication, patience and commitment to seeing problems through to resolution. Ability to think logically and creatively, with a detail-oriented working style, such that all angles of troubleshooting/resolution are covered and captured</li>\n<li style=\"\">Communicating with customers and partners via the online support tool, and via audio and video calls and screen-sharing sessions</li>\n<li style=\"\">Collaborating with Support, Engineering, SREs, Product Management and Customer Success teams. Showing a respect for all team members and customers at all times</li>\n<li style=\"\">Reproducing customer problems internally, to enable the development and testing of a resolution</li>\n<li style=\"\">Collecting information and documenting bugs with Engineering for product/service issues that are impacting customers</li>\n<li style=\"\">Providing feedback to the training and documentation teams so that common or emerging issues can be addressed before they become serious or widespread</li>\n<li style=\"\">Ensuring best practices are followed and processes are adhered to, especially with</li>\n<li style=\"\">regard to ISO27001/9001 compliance, security incidents and data breaches</li>\n<li style=\"\">Actively prioritizing tasks/workload with self-discipline and good timekeeping</li>\n<li style=\"\">Adopting an 'always-learning' mentality, with a humble attitude about knowledge limitations, and the ability to learn from experience and informal/formal instruction. Showing a willingness to share knowledge with team members and customers</li>\n<li style=\"\">Participating in the weekend queue manager/on-call rosters and scheduled public holiday coverage</li>\n<li style=\"\">Clearly communicating with all stakeholders - customers, team members, other departments, management</li>\n<li style=\"\">Participation in escalation calls, when required, to brief stakeholder management on support cases, and assist in the creation of action plans aiming to solve customer issues as quickly as possible. Showing empathy for the customer's situation and listening with the intent to understand the situation clearly</li>\n<li style=\"\">Helping and advising other team members, with knowledge of tickets, best practices around customer service and troubleshooting and knowledge base articles</li>\n<li style=\"\">Building a rounded knowledge of the product/service and considering a subject matter expertise</li>\n</ul>\n<p><strong>Required Skills &amp; Qualifications</strong></p>\n<ul style=\"\">\n<li style=\"\">Excellent Communication - both verbal and written; support is conducted via web-based ticketing system and over web conferencing</li>\n<li style=\"\">Excellent troubleshooting skills</li>\n<li style=\"\">Experience of working on Linux, Unix &amp; Windows Enterprise Server OS, with mixed skills around administration and troubleshooting</li>\n<li style=\"\">Solid understanding of the technical fundamentals of the Internet - you should have a solid knowledge of protocols such as HTTP, SSL and IPv4/v6</li>\n</ul>\n<p><strong>Desired Skills</strong></p>\n<ul style=\"\">\n<li style=\"\">Working knowledge of Java, web containers (e.g. Tomcat, JBoss) and web servers (e.g. Apache, IIS)</li>\n<li style=\"\">Experience of virtualisation in an enterprise environment</li>\n<li style=\"\">Demonstrable collaboration and teamwork skills</li>\n<li style=\"\">Ability to be a good listener; identifying key information in order to reproduce a customer’s problem remotely</li>\n<li style=\"\">Cloud-based platform services - AWS, Azure, Google Cloud Platform</li>\n<li style=\"\">DevOps deployments - Docker, Scripting, Kubernetes</li>\n<li style=\"\">Networking infrastructure - Proxies, Load balancers, Firewalls</li>\n<li style=\"\">Installing/tuning/code analysis of Java</li>\n<li style=\"\">Java performance analysis - Heap maps/JMAP/GC</li>\n<li style=\"\">Directory - LDAP, AD</li>\n<li style=\"\">Databases – SQL</li>\n<li style=\"\">Programming languages - JavaScript, Groovy</li>\n</ul><div class='\"content-conclusion\"'><p><strong>Life at Ping:</strong></p>\n<p><strong>We believe in and facilitate a flexible, collaborative work environment. We’re growing quickly, but remain true to the innovative, can-do startup values that got us here. Most importantly, we keep hiring talented, smart, fun, and genuinely nice people because that’s who we want to succeed with every day. </strong></p>\n<p><strong>Here are just a few of the things that make Ping special:</strong></p>\n<ul style=\"\">\n<li style=\"\">A company culture that empowers you to do your best work.</li>\n<li style=\"\">Employee Resource Groups that create a sense of belonging for everyone.</li>\n<li style=\"\">Regular company and team bonding events.</li>\n<li style=\"\">Competitive benefits and perks.</li>\n<li style=\"\">Global volunteering and community initiatives</li>\n</ul>\n<p>Our Benefits: </p>\n<ul style=\"\">\n<li style=\"\">Generous PTO &amp; Holiday Schedule </li>\n<li style=\"\">Parental Leave</li>\n<li style=\"\">Progressive Healthcare Options</li>\n<li style=\"\">Retirement Programs</li>\n<li style=\"\">Opportunity for Education Reimbursement </li>\n<li style=\"\">Commuter Offset (Specific locations) </li>\n</ul>\n<p><strong>Ping is the collective sum of all our individual experiences, backgrounds and influences and we pride ourselves in growing and learning together. We are committed to building an inclusive and diverse environment where everyone’s individuality is respected and everyone has an Identity. In recruiting for new colleagues, we welcome the unique contributions you can bring and encourage you to be your best self.</strong></p>\n<p><em>We are an Equal Opportunity/Affirmative Action employer.  All qualified applicants will receive consideration for employment without regard to race, color, religion, sex including sexual orientation and gender identity, national origin, disability, protected Veteran Status, or any other characteristic protected by applicable federal, state, or local law.</em></p></div><img src=\"https://remotive.com/job/track/1992533/blank.gif?source=public_api\" alt=\"\"/>"
  },
  {
    "id": 1992156,
    "url": "https://remotive.com/remote-jobs/software-dev/software-engineer-1992156",
    "title": "Software Engineer",
    "company_name": "Deputy",
    "company_logo": "https://remotive.com/job/1992156/logo",
    "category": "Software Development",
    "tags": [
      "golang",
      "javascript",
      "php"
    ],
    "job_type": "full_time",
    "publication_date": "2025-04-06T14:50:12",
    "candidate_required_location": "Canada",
    "salary": "",
    "description": "<div><span style=\"\">Deputy is a global SaaS workforce management company headquartered in Sydney, San Francisco, and London.  </span><span style=\"font-size: 16px\">Our platform serves over 1.5 million workers and 375,000 workplaces across 100+ countries. We are backed by top global investors and recently achieved Unicorn status. </span></div><div><br></div><div><span style=\"font-size: 16px\">At Deputy, we’re improving the world of work, one shift at a time, for 80% of the world’s workforce: hourly workers. These are the dedicated employees who keep our world running – from baristas to nurses, cleaners to delivery drivers, florists to factory workers. Despite their vital role in society, most workplace technology has focused on those workers who sit behind a desk, but at Deputy, we transform the frontline. When businesses use Deputy, their workplaces thrive – the business is more profitable, compliant, and productive, while the workers are more engaged and happier at work.</span></div><div><br></div><div><span style=\"font-size: 16px\">If you’re passionate about creating solutions that put people first and helping businesses and their teams thrive, join us at Deputy and make an impact where it matters most!</span></div><div><br></div><div><b>The Role</b></div><div><br></div><div><span style=\"\">As a Software Engineer, you will be working closely with your peers, product, design and leadership to build amazing products and features for the Deputy platform, delivering services and products to millions of users and businesses from small &amp; medium to enterprise.</span></div><br><br><div class=\"h3\">Responsibilities </div><li style=\"\">Working independently to solve complex, highly ambiguous customer facing problems.</li><li style=\"\">Scope, specify, design, implement and deliver software solutions, applying modern industry best practices to deliver resilient, high performance, high-quality, and scalable systems and applications.</li><li style=\"\">Own the quality of your work by thoroughly testing your solutions, including writing automated tests.</li><li style=\"\">Collaborate with the engineering and cross-functional stakeholders to determine requirements and deliver complex problems.</li><li style=\"\">Write simple, efficient, self-documented modular high-quality code that follows best practices.</li><li style=\"\">Investigate debug and solve issues within a bounded context.</li><li style=\"\">Provide coaching to junior team members across the entire SDLC.</li><li style=\"\">Engage in technical discussion of solutions and process improvement through documentation, design reviews, pair programming, code review and technology discussions</li><br><br><div class=\"h3\">Requirements &amp; Qualifications</div><li style=\"\">You are a skilful engineer with high standards and a passion for quality backed by 3+ years of related work experience.</li><li style=\"\">You are customer obsessed, always working to deliver solutions that give the best possible experience for customers.</li><li style=\"\">You show a bias for action, and have a demonstrated track record of delivering high quality, scalable, and fault tolerant software systems.</li><li style=\"\">You have strong computer science fundamentals: algorithms and data structures.</li><li style=\"\">You are programming language agnostic, but have some experience in Golang, PHP, Javascript.</li><li style=\"\">You have expertise in API design (REST &amp; RPC)  and its frameworks. Including using protobuf, gRPC, OpenAPI</li><li style=\"\">Experience with building service oriented architecture, microservices, and modern techniques and tools around it. Including using Docker, ECS, Lambda, SQS, Kinesis, etc</li><li style=\"\">Experience in a few persistence, storage and caching mechanisms. Including MySQL, Redis, DynamoDB, S3, etc</li><li style=\"\">You have experience embedding 3rd party software solutions into other platforms, providing a seamless experience for users. </li><li style=\"\">You build systems that include appropriate monitoring and observability; employing  modern best practices for fault tolerance including but not limited to caching, eventual consistency, queues, load balancing, circuit breaking, etc.</li><div><span style=\"font-size: 16px\">Deputy believes in equal opportunity and that inclusiveness and diversity promotes innovation. Our global team members are from a variety of cultures. And we welcome different perspective and skills. </span></div><div><br></div><div><span style=\"font-size: 16px\">#LI-Remote</span></div><img src=\"https://remotive.com/job/track/1992156/blank.gif?source=public_api\" alt=\"\"/>"
  },
  {
    "id": 1991105,
    "url": "https://remotive.com/remote-jobs/hr/recruiter-1991105",
    "title": "Recruiter",
    "company_name": "attivopartners",
    "company_logo": "https://remotive.com/job/1991105/logo",
    "category": "Human Resources",
    "tags": [
      "accounting",
      "social media",
      "mentoring",
      "partnerships",
      "SOLID",
      "startup",
      "ATS",
      "diversity",
      "travel",
      "insurance"
    ],
    "job_type": "full_time",
    "publication_date": "2025-04-06T12:50:39",
    "candidate_required_location": "USA",
    "salary": "$65,000-75,000 plus commission",
    "description": "<div class='\"content-intro\"'>\n<p><strong>Join the Rapidly Growing Team at Attivo Partners!</strong></p>\n<p>Are you dedicated to excellence and eager to advance your career? Passionate about technology and startups? Excited to work with some of the most innovative early-stage companies in the world? If so, Attivo Partners is the place for you!</p>\n<p><strong>Why Attivo?</strong></p>\n<p>Attivo Partners is a fast-growing full-service finance and accounting consulting firm headquartered in San Francisco, with a presence in major startup hubs across the US. Our remote teams specialize in providing fractional CFO and accounting services to venture-backed emerging growth clients, supporting their journey from inception to over $50M in revenue.</p>\n<p><strong>What We Offer:</strong></p>\n<ul style=\"\">\n<li style=\"\"><strong>Collaborative Environment:</strong> Work alongside a talented team with extensive experience in venture-backed companies. At Attivo, we believe in teamwork and value the unique insights and creativity each member brings.</li>\n<li style=\"\"><strong>Culture of Growth:</strong> We thrive on the challenges presented by diverse and exciting clients, offering unparalleled learning and professional development opportunities.</li>\n<li style=\"\"><strong>Mentorship and Training:</strong> We are committed to nurturing talent and providing ongoing mentoring and training to help you grow personally and professionally.</li>\n<li style=\"\"><strong>Flexibility:</strong> We understand the importance of balance and are dedicated to maintaining a culture that supports your career and personal life.</li>\n</ul>\n<p><strong>Our Values:</strong></p>\n<ul style=\"\">\n<li style=\"\"><strong>Lasting Relationships:</strong> We build solid and enduring connections with our clients and team members.</li>\n<li style=\"\"><strong>Data-Driven Insights:</strong> We leverage data to drive intelligent decisions and impactful results.</li>\n<li style=\"\"><strong>Growth-Focused Mindset:</strong> We embrace opportunities for continuous improvement and innovation.</li>\n<li style=\"\"><strong>Collaboration-First:</strong> We prioritize teamwork and believe the best solutions come from working together.</li>\n<li style=\"\"><strong>Culture-Conscious:</strong> We foster a supportive and inclusive culture where everyone can thrive.</li>\n</ul>\n<p>Join us at Attivo Partners and be part of a team that's shaping the future of finance and accounting for startups. Let's grow together!</p>\n</div><p><strong>Role Overview</strong></p>\n<p>The Recruiter is responsible for attracting, sourcing, and recruiting qualified candidates for various positions across the organization. They are responsible for administering the full-cycle recruitment processes, from sourcing and screening candidates to coordinating interviews.  They will collaborate with fellow team members on initiatives that improve recruitment strategies and processes. </p>\n<p><strong>Responsibilities</strong></p>\n<ul style=\"\">\n<li style=\"\">Source candidates through various channels, including job boards, social media, networking events, and employee referrals.</li>\n<li style=\"\">Screen resumes, conduct initial phone screenings, and assess candidate qualifications.</li>\n<li style=\"\">Schedule and coordinate interviews between candidates and hiring managers.</li>\n<li style=\"\">Maintain a strong candidate pipeline for current and future hiring needs.</li>\n<li style=\"\">Manage and update applicant tracking system (ATS - Greenhouse) and recruitment databases.</li>\n<li style=\"\">Build relationships with potential candidates to create a strong talent network.</li>\n<li style=\"\">Stay updated on industry trends and best practices in talent acquisition.</li>\n<li style=\"\">Promote diversity in recruitment efforts by ensuring inclusive hiring practices are implemented, fostering a diverse workforce.</li>\n<li style=\"\">Identify opportunities for continuous improvement in recruitment processes and implement new tools, techniques, and technologies to streamline hiring, as applicable..</li>\n<li style=\"\">Other duties as assigned.</li>\n</ul>\n<p><strong>Requirements</strong></p>\n<ul style=\"\">\n<li style=\"\">Understanding of recruiting best practices and industry trends</li>\n<li style=\"\">Critical thinking and problem-solving skills</li>\n<li style=\"\">Knowledge of recruitment tools, applicant tracking systems - preferably Greenhouse</li>\n<li style=\"\">Excellent communication and interpersonal skills, with the ability to build relationships across all levels of the organization.</li>\n<li style=\"\">Strong interview and communication skills.</li>\n<li style=\"\">Ability to work independently and as part of a team.</li>\n<li style=\"\">Experience in driving diversity and inclusion efforts within recruitment, preferred</li>\n</ul>\n<p><strong>Qualifications</strong></p>\n<ul style=\"\">\n<li style=\"\">Bachelor’s degree in Human Resources, Business Administration, or a related field</li>\n<li style=\"\">1-2 years of experience in full-cycle recruitment, preferably in the accounting and/or finance industry.</li>\n</ul>\n<p><strong>Location</strong> </p>\n<ul style=\"\">\n<li style=\"\">Remote – Pacific Time Zone</li>\n<li style=\"\">Ability to travel at least twice a year for All-Staff Retreats &amp; Regional Meetups, and as needed for recruiting vendor partnerships and networking opportunities.</li>\n</ul>\n<p><strong>Reports To:</strong> Recruiting Manager</p>\n<p><strong>Hiring Range:  $65,000-75,000, plus commission (based on experience)</strong></p>\n<p><strong>Commissions: </strong></p>\n<ul style=\"\">\n<li style=\"\">For each full-time candidate sourced by the Recruiter within North America, they will be paid a lump sum of $400.00 one hundred twenty (120) days after the candidate’s start date.</li>\n<li style=\"\">Fees listed above will be considered earned and due in accordance with the periods listed above only if the Recruiter is currently an active employee when fees are paid. </li>\n<li style=\"\">Hire date will be used for purposes of calculating one hundred twenty (120) days. </li>\n</ul>\n<p><strong>About Attivo Partners</strong></p>\n<p>Attivo Partners is a full-service finance and accounting consulting firm with our HQ in San Francisco, California and a presence &amp; clientele in the major start-up hubs across the US. We provide our emerging growth clients with CFO, accounting, and finance services across industries and at all stages of early growth – from zero to &gt;$50M in revenue.</p><div class='\"content-conclusion\"'><div class=\"h3\"><strong>Benefits</strong></div>\n<div>Benefits for full-time employees include: Health, Dental, and Vision Insurance (100% coverage for employees on base plan, 70% coverage for additional family members), participation in Flexible Spending Accounts and 401(k), 3 weeks PTO, voluntary Life Insurance &amp; Disability plans, and work-from-home allowance. Primary caregivers and others requiring a flexible work schedule or reduced hours are encouraged to apply; benefits may be prorated for part-time hires.</div>\n<div class=\"h3\"><strong>Final Notes</strong></div>\n<div>Please note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities, and activities may change at any time with or without notice.</div>\n<div> </div>\n<div>Attivo Partners is an equal opportunity employer and is committed to a diverse workplace. People from diverse racial, ethnic and cultural backgrounds, women, LGBTQ+ individuals, and persons with disabilities are highly encouraged to apply. </div></div><img src=\"https://remotive.com/job/track/1991105/blank.gif?source=public_api\" alt=\"\"/>"
  },
  {
    "id": 1992446,
    "url": "https://remotive.com/remote-jobs/all-others/senior-combat-designer-1992446",
    "title": "Senior Combat Designer",
    "company_name": "Deck13 Interactive GmbH",
    "company_logo": "https://remotive.com/job/1992446/logo",
    "category": "All others",
    "tags": [
      "AI/ML",
      "game design",
      "team management",
      "scripting",
      "diversity",
      "mental health"
    ],
    "job_type": "full_time",
    "publication_date": "2025-04-06T10:51:09",
    "candidate_required_location": "Germany",
    "salary": "",
    "description": "<p><strong>Our Story:</strong></p>\n<p>At DECK 13 Interactive, we’re more than just a game development studio—we’re a diverse, passionate community of creators dedicated to crafting unforgettable gaming experiences. Since our founding in 2001, in the heart of Frankfurt, Germany, we’ve been pushing the boundaries of what’s possible in PC and console games. Now part of the PulluP Entertainment group, our team of around 100 talented professionals continues to shape the future of gaming.<br>We’re the minds behind titles like <em>Lords of the Fallen</em> , <em>The Surge</em> series, and <em>Atlas Fallen</em> , known for their rich worlds and immersive gameplay. But we believe the best games are still ahead of us, and that’s where you come in.</p>\n<p><strong>Your Quest:</strong></p>\n<p>As our <strong>Senior Combat Designer (f/m/x)</strong>, you’ll play a key role in shaping enemy design and AI behavior, collaborating with a diverse and talented team to craft gameplay moments that are both challenging and unforgettable.</p>\n<ul style=\"\">\n<li style=\"\"><strong>Design Engaging Combat Challenges</strong>: Create and develop enemy archetypes that complement the player’s moveset while offering exciting and fair challenges.</li>\n<li style=\"\"><strong>Build &amp; Polish</strong>: Implement and refine enemy behaviors and movesets in <strong>Unreal Engine 5</strong>, ensuring a smooth and immersive combat experience.</li>\n<li style=\"\"><strong>Inspire &amp; Mentor</strong>: Share your expertise by guiding and supporting junior team members alongside the Lead Combat Designer.</li>\n<li style=\"\"><strong>Shape Combat Vision</strong>: Craft and refine the combat experience, focusing on enemy creation and AI behavior. Contribute to driving innovation and ensuring high-quality design while fostering a shared vision across the team.</li>\n<li style=\"\"><strong>Collaborate Across Teams</strong>: Work closely with game designers, animators, artists, programmers, audio specialists, and producers to bring your ideas to life within deadlines.</li>\n<li style=\"\"><strong>Communicate &amp; Document</strong>: Clearly document and share combat features to ensure alignment across the team.</li>\n</ul>\n<p><strong>Your Toolkit:</strong></p>\n<p>We value your skills and potential as much as your experience. If you see yourself thriving in this role but don’t meet every single requirement, we encourage you to apply!</p>\n<ul style=\"\">\n<li style=\"\"><strong>Experience</strong>: 5+ years in game design with a focus on combat systems and at least one shipped title.</li>\n<li style=\"\"><strong>Technical Skills</strong>: Strong knowledge of Unreal Engine 5 and expertise in designing combat AI behaviors.</li>\n<li style=\"\"><strong>Collaborative Spirit</strong>: A team player with strong communication skills and a passion for working in a creative, interdisciplinary environment.</li>\n<li style=\"\"><strong>Mindset</strong>: A positive, solution-oriented attitude, with a willingness to embrace challenges and learn from diverse perspectives.</li>\n</ul>\n<p><strong>You Get Extra XP for:</strong></p>\n<ul style=\"\">\n<li style=\"\">Familiarity with complex scripting.</li>\n<li style=\"\">User experience design is a plus.</li>\n<li style=\"\">Prior experience &amp; responsibility in project or team management roles.</li>\n</ul>\n<p>Power-Ups You Receive:</p>\n<p>At DECK 13 Interactive, our people are at the heart of everything we do. We believe in creating an environment where you feel valued, supported, and empowered to do your best work. Here’s what we offer to make that happen:</p>\n<ul style=\"\">\n<li style=\"\">A modern, centrally located office in Frankfurt, Germany (near Messe)</li>\n<li style=\"\">Free language courses to help you expand your skills</li>\n<li style=\"\">Monthly allowances for remote working and gym memberships</li>\n<li style=\"\">A monthly allowance for the Deutschlandticket to ease your commute</li>\n<li style=\"\">Tax-free Probonio vouchers available every month</li>\n<li style=\"\">Free access to an online mental health platform (Bloom) to support your well-being</li>\n<li style=\"\">Opportunities for career growth with a yearly learning &amp; development budget</li>\n<li style=\"\">28 days of paid vacation, plus the 24th and 31st of December off</li>\n</ul>\n<p><strong>Our Commitment to Inclusivity:</strong></p>\n<p>DECK 13 Interactive is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees. We welcome applications from all individuals regardless of gender, race, ethnicity, religion, sexual orientation, age, disability, or any other characteristic that makes you unique.<br>We believe that diverse teams create the best games, and we’re dedicated to building a workplace where everyone can thrive.</p>\n<div class=\"h1\">About the company</div>\n<p>At DECK 13 Interactive, we’re more than just a game development studio—we’re a diverse, passionate community of creators dedicated to crafting unforgettable gaming experiences. Since our founding in 2001, in the heart of Frankfurt, Germany, we’ve been pushing the boundaries of what’s possible in PC and console games. Now part of the PulluP Entertainment group, our team of around 100 talented professionals continues to shape the future of gaming.</p>\n<p>We’re the minds behind titles like <em>Lords of the Fallen</em>, <em>The Surge</em> series, and <em>Atlas Fallen</em>, known for their rich worlds and immersive gameplay. But we believe the best games are still ahead of us...</p>\n<img src=\"https://remotive.com/job/track/1992446/blank.gif?source=public_api\" alt=\"\"/>"
  },
  {
    "id": 1992838,
    "url": "https://remotive.com/remote-jobs/writing/copywriter-lead-associate-assistant-1992838",
    "title": "Copywriter Lead Associate/Assistant",
    "company_name": "Wellhub",
    "company_logo": "https://remotive.com/job/1992838/logo",
    "category": "Writing",
    "tags": [
      "digital marketing"
    ],
    "job_type": "full_time",
    "publication_date": "2025-04-06T10:51:05",
    "candidate_required_location": "Brazil",
    "salary": "",
    "description": "<p><strong>Your wellbeing matters. Join a company that cares.</strong></p>\n<p><strong>GET TO KNOW US</strong></p>\n<p>Wellhub (formerly Gympass*) is a corporate wellness platform that connects employees to the best partners for fitness, mindfulness, therapy, nutrition, and sleep, all included in one subscription designed to cost less than each individual partner. Founded in 2012 and headquartered in NYC, we have a growing global team in 11 countries. At Wellhub, you have the opportunity to build a career in a high-growth tech company that places wellbeing at the foundation of its culture, and contribute to making every company a wellness company. <br><br><strong>*Big news: Gympass is now Wellhub! </strong><br>We are thrilled to announce our rebranding as Wellhub, marking a significant milestone in our journey. This transformation reflects our evolution from a “pass for gyms” to a comprehensive employee wellbeing solution. With our refreshed identity, we are poised to embark on an exciting new chapter of growth and expansion. We are elevating our offerings, including a completely new app experience and an expanded network of wellbeing partners. Learn more about it <a href=\"%22https:/gympass.com/en-us/blog/gympass-news/gympass-rebrands-to-wellhub/%22\" rel=\"nofollow\" target='\"_blank\"'>here.</a> <br><br><strong>THE OPPORTUNITY</strong></p>\n<p>We are hiring a Copywriter Lead Associate to our Marketing team.</p>\n<p>We’re looking for a talented Copywriter to transform the way copy is created and managed to drive Wellhub’s growth. This role will create, edit, and optimize compelling copy for paid media and CRM channels. This position requires a high level of creativity and big ideas, as well as a masterful eye for editing.</p>\n<div class=\"h1\"><strong>YOUR IMPACT</strong></div>\n<ul style=\"\">\n<li style=\"\">Craft creative and persuasive copy for Gympass’s largest, key campaigns.</li>\n<li style=\"\">Work on campaigns for both B2B and B2C audiences, helping drive revenue through marketing.</li>\n<li style=\"\">Consistently brainstorm and collaborate with team for new ideas and strategies.</li>\n<li style=\"\">Research industry topics to bring ideas that are relevant, innovative, and original.</li>\n<li style=\"\">Develop a deep understanding of the various Gympass audiences.</li>\n<li style=\"\">Oversee the work of freelance writers, making edits &amp; suggestions to their work as needed.</li>\n<li style=\"\">Participate in meetings with the creative agency, representing Gympass and working to optimize workflow and output.</li>\n<li style=\"\">Deliver creative copy that is on brief, on time, on brand, and effectively communicates the messages as outlined by marketing, internal stakeholders, and business objectives.</li>\n<li style=\"\">Take part in after-action reviews, analyzing results to identify key learnings and opportunities. </li>\n<li style=\"\">Live the mission: inspire and empower others by genuinely caring for your own wellbeing and your colleagues. Bring wellbeing to the forefront of work, and create a supportive environment where everyone feels comfortable taking care of themselves, taking time off, and finding work-life balance.</li>\n</ul>\n<div class=\"h1\"><strong>WHO YOU ARE</strong></div>\n<ul style=\"\">\n<li style=\"\">Remote position for candidates residing outside the state of São Paulo. (For São Paulo residents, attendance at the office is required only when requested.)</li>\n<li style=\"\">Fluency in English is mandatory. </li>\n<li style=\"\">Familiarity with Asana, Figma and Google Suite is a plus. </li>\n<li style=\"\">Previous experience as a Copywriter in advertising, content or social media.</li>\n<li style=\"\">Understanding of how to optimize content across digital platforms.</li>\n<li style=\"\">Excellent writing and language skills.</li>\n<li style=\"\">Love of writing in all forms and across channels/formats, and can adapt tone and style while still ensuring a cohesive brand voice.</li>\n<li style=\"\">Ability to work cross functionally, take direction well and collaborate with teams to integrate input from multiple stakeholders.</li>\n<li style=\"\">Leadership skills to oversee freelance writers, provide feedback, and ensure brand cohesion.</li>\n<li style=\"\">Strong project management and organizational skills with ability to manage simultaneous projects in a fast-paced, deadline-driven work environment.</li>\n<li style=\"\">A results-oriented problem-solving mindset to translate company business goals into copywriting.</li>\n</ul>\n<p>We recognize that individuals approach job applications differently. We strongly encourage all aspiring applicants to go for it, even if they don't match the job description 100%. We welcome your application and will be delighted to explore if you could be a great fit for our team. For this specific role, please note that previous experience in copywriting for digital marketing and social media campaign and Fluency in English are mandatory requirements.</p>\n<div class=\"h2\"><strong>WHAT WE OFFER YOU (Latam)</strong></div>\n<p>We're a wellness company that is committed to the health and wellbeing of our employees. Our flexible program allows you to customize your benefits, according to your needs! </p>\n<p>Our benefits include:</p>\n<p><strong>WELLNESS:</strong> Health, dental, and life insurance.</p>\n<p><strong>FLEXIBLE WORK:</strong> At Wellhub, flexibility fosters a happier, healthier, and more productive work environment for everyone. As a Flexible First company, we offer two work model options: flexible hybrid and full remote, and make the office a place for collaboration, community, and team building. The model for this role can be discussed with your recruiter and hiring manager. We offer all employees a home office stipend and a monthly flexible work allowance to help cover the costs of working from home. </p>\n<p><strong>FLEXIBLE SCHEDULE: </strong>Wellhubbers and their leaders can make the best decisions for their scope. This includes flexibility to adjust their working hours based on their personal schedule, time zone, and business needs.</p>\n<p><strong>WELLHUB:</strong> We believe in our mission and encourage our employees and their families to take care of their wellbeing too. Access onsite gyms and fitness studios, digital fitness programs, and online wellness resources for meditation, nutrition, mental health support, and more. You will receive the Gold plan at no cost, and other premium plans will be significantly discounted.</p>\n<p><strong>PAID TIME OFF:</strong> We know how important it is that our employees take time away from work to recharge. Vacations after 6 months and 3 days off per year + 1 day off for each year of tenure (up to 5 additional days) + extra day off for your birthday.</p>\n<p><strong>PAID PARENTAL LEAVE: </strong>Welcoming a new child is one of the most special moments in your life and we want our employees to take the time to be present and enjoy their growing family. We offer 100% paid parental leave to all new parents and extended maternity leave.</p>\n<p><strong>CAREER GROWTH:</strong> Outstanding opportunities for personal and career growth. That means we maintain a growth mindset in everything we do and invest deeply in employee development.  </p>\n<p><strong>CULTURE:</strong> An exciting and supportive atmosphere with ambitious people from around the world! You’ll partner with global colleagues and share in the success of a high-growth technology company disrupting the health and wellness space. Our value-based culture of trust, flexibility, and integrity makes this possible every day. Find more info on our <a href=\"%22https:/wellhub.com/careers/%22\" rel=\"nofollow\">careers page</a>! </p>\n<p> </p>\n<p><strong>And to get a glimpse of Life at Wellhub… Follow us on </strong><a href=\"%22https:/www.instagram.com/lifeatwellhub/%22\" rel=\"nofollow\"><strong>Instagram</strong></a><strong> @lifeatwellhub and </strong><a href=\"%22https:/www.linkedin.com/company/wellhub/mycompany/%22\" rel=\"nofollow\"><strong>LinkedIn</strong></a><strong>!</strong></p>\n<p> </p>\n<div class=\"h1\"><strong>Diversity, Equity, and Belonging at Wellhub</strong></div>\n<p>We aim to create a collaborative, supportive, and inclusive space where everyone knows they belong.</p>\n<p>Wellhub is committed to creating a diverse work environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, religion, color, sex, gender identity or expression, sexual orientation, age, non-disqualifying physical or mental disability, national origin, veteran status, or any other basis covered by appropriate law.</p>\n<p>Questions on how we treat your personal data? See our <a href=\"%22https:/lifeat.gympass.com/?p=636%22\" rel=\"nofollow\">Aviso de Privacidade para Candidatos.</a> </p>\n<p>#LI-REMOTE</p>\n<p><strong id='\"docs-internal-guid-7c408855-7fff-8842-f062-c96b1753b2a9\"'></strong><br><br></p>\n<img src=\"https://remotive.com/job/track/1992838/blank.gif?source=public_api\" alt=\"\"/>"
  },
  {
    "id": 1992340,
    "url": "https://remotive.com/remote-jobs/marketing/demand-generation-manager-1992340",
    "title": "Demand Generation Manager",
    "company_name": "Directive",
    "company_logo": "https://remotive.com/job/1992340/logo",
    "category": "Marketing",
    "tags": [
      "seo",
      "CRO",
      "performance marketing"
    ],
    "job_type": "full_time",
    "publication_date": "2025-04-06T10:50:59",
    "candidate_required_location": "Mexico",
    "salary": "",
    "description": "<p style=\"min-height:1.5em\">Directive Consulting is the performance marketing agency for B2B companies. We use Customer Generation (a marketing methodology developed by us) which focuses on SQLs and Customers instead of traditional metrics like MQLs. We offer Paid Media, SEO/Content, CRO, and Video to our clients by creating comprehensive digital marketing strategies that allow our clients to hit their SQL targets, every time.</p><p style=\"min-height:1.5em\">At Directive, we're always looking ahead to build a network of talented individuals who excel in crafting data-driven strategies, optimizing campaigns, and fueling demand for innovative brands. </p><p style=\"min-height:1.5em\">As we continue to expand, we’re seeking forward-thinking professionals who thrive in fast-paced environments, are obsessed with performance metrics, and are eager to make their mark in B2B marketing. </p><p style=\"min-height:1.5em\">If you're ready to explore future opportunities and be part of a team that values your expertise and creativity, we’d love to hear from you!</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>About The Role</strong></p><p style=\"min-height:1.5em\">We are looking to offer a compelling and competitive new demand gen offering for our customers here at Directive. In this role, you will directly work with no more than five accounts and be directly responsible for their performance marketing. </p><p style=\"min-height:1.5em\">The ideal candidate for this role is an exceptionally strong T-Shaped Marketer with deep expertise in the SaaS marketplace across Paid, SEO, and CRO. A crucial part of this role will not only be executing campaigns; but also, interfacing with customers, pitching strategy, and ensuring that results are exceeded.</p><p style=\"min-height:1.5em\">We value your ability to drive client results as an individual contributor and believe that the ideal candidate revels in owning the success of their client portfolio. You will only be successful in this role if you are strong at marketing strategy, execution, communication, and project management.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Roles &amp; Responsibilities</strong></p><ul style=\"\"><li style=\"\"><p style=\"min-height:1.5em\">Own the success of SMB clients, across channels</p></li><li style=\"\"><p style=\"min-height:1.5em\">Handle client relationships with poise, confidence, and empathy</p></li><li style=\"\"><p style=\"min-height:1.5em\">Project manage and organize your accounts</p></li><li style=\"\"><p style=\"min-height:1.5em\">Build relationships with your point of contacts</p></li><li style=\"\"><p style=\"min-height:1.5em\">Deep technical knowledge of Strategy, Paid Media, SEO, and CRO for tech companies</p></li><li style=\"\"><p style=\"min-height:1.5em\">Strong SaaS background preferred </p></li><li style=\"\"><p style=\"min-height:1.5em\">Skilled at having a large impact in a very specific role</p></li><li style=\"\"><p style=\"min-height:1.5em\">Creative spark for marketing + deep passion for getting results</p><p style=\"min-height:1.5em\"></p></li></ul><p style=\"min-height:1.5em\"><strong> What You Offer</strong></p><ul style=\"\"><li style=\"\"><p style=\"min-height:1.5em\">2+ years of experience in agency-side marketing</p></li><li style=\"\"><p style=\"min-height:1.5em\">2+ years of experience in performance marketing</p></li><li style=\"\"><p style=\"min-height:1.5em\">Brilliant strategist and a truly T-shaped marketer</p></li><li style=\"\"><p style=\"min-height:1.5em\">World-class project manager who knows how to get things done on time and below cost</p></li><li style=\"\"><p style=\"min-height:1.5em\">Availability to travel</p><p style=\"min-height:1.5em\"></p></li></ul><p style=\"min-height:1.5em\"><strong>What We Offer </strong></p><ul style=\"\"><li style=\"\"><p style=\"min-height:1.5em\">🏡   No employee at Directive Mexico makes less than the living wage of $2,500 MXN per month </p></li><li style=\"\"><p style=\"min-height:1.5em\">Benefits to Support the Whole Person:</p><ul style=\"\"><li style=\"\"><p style=\"min-height:1.5em\"><strong>🧠  Mental - </strong>Access to certified therapists through <strong>Spring Health, </strong>membership to <strong>Headspace</strong></p></li><li style=\"\"><p style=\"min-height:1.5em\"><strong>💪  Physical</strong> - Physical therapy through <strong>Omada, </strong>fertility support through <strong>Carrott, </strong>thousands of <strong>Aaptiv</strong> virtual workouts<strong>, </strong>complimentary <strong>One Medical</strong> membership for primary and virtual care</p></li><li style=\"\"><p style=\"min-height:1.5em\"><strong>🛫 Time Off - Unlimited PTO (2-week minimum), Paid Company Holidays, Your Birthday Off, End of Year Recharge (Closed December 24 - January 1), Paid Parental Leave</strong></p></li></ul></li></ul><p style=\"min-height:1.5em\"><strong>🌴  Annual Anniversary Trip</strong> to Newport Beach, CA with peers and executive leadership for fun and entertainment!</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Work Environment Requirements</strong></p><p style=\"min-height:1.5em\">For roles located in Mexico, you will have the ability to work hybrid from our office in Mexico City. </p><p style=\"min-height:1.5em\">As a remote-first company we primarily collaborate with our colleagues through virtual meetings (Zoom), and Slack. In this role, you will be required to operate a laptop computer (PC or Mac available), computer software platforms, and other office productivity tools as necessary. Due to the nature of this role, you must be able to remain stationary for extended periods, must be able to observe and interpret written and/or verbal communication, must have reliable internet access, and a professional background.</p><p style=\"min-height:1.5em\">To perform this job successfully, an individual must be able to perform each essential job duty satisfactorily. Reasonable accommodations may be made to enable qualified individuals with disabilities to perform essential job functions.</p><p style=\"min-height:1.5em\">If you require reasonable accommodations in completing this application, interviewing, completing any pre-employment testing, or otherwise participating in the employee selection process, direct your inquiries to careers@directiveconsulting.com.</p><p style=\"min-height:1.5em\">For global locations, you must have established and current work authorization and permanently reside in that country.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Additional Information</strong></p><p style=\"min-height:1.5em\">At Directive, one of our core values is People First. We’re committed to fostering a more diverse and inclusive culture in the digital landscape. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.</p><p style=\"min-height:1.5em\">#LI-JA1</p><img src=\"https://remotive.com/job/track/1992340/blank.gif?source=public_api\" alt=\"\"/>"
  },
  {
    "id": 1993157,
    "url": "https://remotive.com/remote-jobs/qa/manual-qa-engineer-1993157",
    "title": "Manual QA Engineer",
    "company_name": "Altium®",
    "company_logo": "https://remotive.com/job/1993157/logo",
    "category": "QA",
    "tags": [
      "C#",
      "CI/CD"
    ],
    "job_type": "full_time",
    "publication_date": "2025-04-06T08:51:05",
    "candidate_required_location": "Poland",
    "salary": "",
    "description": "<div class='\"content-intro\"'>\n<div class=\"h4\"><strong><img alt='\"\"' height='\"33\"' src=\"%22https:/mma.prnewswire.com/media/1009467/Altium_Black_Logo.jpg?p=publish%22\" width='\"157\"'></strong></div>\n<div class=\"h4\"> </div>\n<div class=\"h4\"> </div>\n<div class=\"h4\"><strong>⚡️ Why Altium?</strong></div>\n<p>Altium is transforming the way electronics are designed and built. From startups to world’s technology giants, our digital platforms give more power to PCB designers, supply chain, and manufacturing, letting them collaborate as never before.</p>\n<ul style=\"\">\n<li style=\"\">Constant innovation has created a transformative technology, unique in its space</li>\n<li style=\"\">More than 30,000 companies and 100,000 electronics engineers worldwide use Altium</li>\n<li style=\"\">We are growing, debt-free, and financially strong, with the resources to become #1 in the EDA industry</li>\n</ul>\n</div>\n<p> </p>\n<p><strong>About the role:</strong></p>\n<p>As a part of the R&amp;D Department, you will participate in the testing process during the implementation of new changes in projects/products, ensuring the high quality of Altium Designer, and related Altium products based on its following quality standards.<br>As QA Engineer, you will work with the Team on the planning process, deliver new features and coordinate testing efforts between teams/PM/TL/RM, the support team, and technical writers. <br>As QA Engineer, you will develop and maintain automated tests using C#, work with desktop automation tools and assist in troubleshooting issues with autotests.<br>As QA Engineer, you will be a part of an ambitious team of professionals, which is growing, debt-free, and financially strong, with the resources to become #1 in the Electronica industry<br><br><br></p>\n<div class=\"h4\"><strong>Whom we’re looking for, what you need to have:</strong></div>\n<ul style=\"\">\n<li style=\"\">4+ years of experience as a QA Engineer</li>\n<li style=\"\">1+ years of driving flow in the QA team.</li>\n<li style=\"\">Knowledge of CI/CD</li>\n<li style=\"\">Strong analytical and problem-solving skills</li>\n<li style=\"\">VCS systems (SVN, GIT) experience </li>\n<li style=\"\">Experience in programming and automation scripting</li>\n<li style=\"\">Familiarity with CAD tools will be highly regarded, further enhancing your potential contributions to our team.</li>\n<li style=\"\">Ability to identify flaws in testing processes, toolsets, and infrastructure, and propose and drive necessary improvements.</li>\n<li style=\"\">Upper-intermediate level of written and spoken English</li>\n</ul>\n<p> </p>\n<p><strong>Preferred Experience:</strong></p>\n<ul style=\"\">\n<li style=\"\">Experience with vector graphic editors (CAD)</li>\n<li style=\"\">Experience in testing of desktop applications</li>\n<li style=\"\">Experience in electronic engineering or similar</li>\n<li style=\"\">Virtualization basic knowledge (VMWare, VBox, Virtual PC)</li>\n<li style=\"\">Traffic sniffers knowledge (Fiddler, HTTP Debugger)</li>\n<li style=\"\">Performance testing tools knowledge (i.e. Jmeter)</li>\n<li style=\"\">Understanding of OOP language (C# or Java)</li>\n<li style=\"\">Experience with automation testing (as a plus)</li>\n</ul>\n<p> </p>\n<p><strong>Our Benefits:</strong></p>\n<ul style=\"\">\n<li style=\"\">🏥 Private medical insurance  </li>\n<li style=\"\">❤️ Group life insurance</li>\n<li style=\"\">🏦 Contributions to your Kafeteria MyBenefit account</li>\n<li style=\"\">🧘 nilo.health, mental health and wellbeing support </li>\n<li style=\"\">📚 Professional development support </li>\n<li style=\"\">🥳  Employee referral and employee-of-the-month programs</li>\n<li style=\"\">🖥 Home internet allowance</li>\n<li style=\"\">🏡 Flexible working arrangements available based on role and location</li>\n</ul>\n<div class='\"content-conclusion\"'>\n<div class=\"h4\"><strong>🎯 What Matters to Us</strong></div>\n<ul style=\"\">\n<li style=\"\"><strong>Big-thinking </strong><em>in pursuit of purpose</em></li>\n<li style=\"\"><strong>Diversity </strong><em>of thought</em></li>\n<li style=\"\"><strong>Courage</strong><em> of conviction</em></li>\n<li style=\"\"><strong>Transparency</strong><em> of intent</em></li>\n<li style=\"\"><strong>Ingenuity</strong><em> of AND</em></li>\n<li style=\"\"><strong>Agility</strong><em> in action</em></li>\n<li style=\"\"><strong>Adaptability</strong><em> of approach</em></li>\n<li style=\"\"><strong>Grit</strong><em> in pursuit of mission</em></li>\n</ul>\n<div class=\"h4\"><strong>🌍 Also, we would like you to know</strong></div>\n<div class=\"h4\">We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender, gender identity or expression, or veteran status. We are proud to be an equal opportunity workplace.</div>\n<p><strong>💡 Learn more about why a career at Altium is an opportunity like no other:</strong> <a href=\"%22https:/www.youtube.com/watch?v=cAYCOLpPLPE%22\" rel=\"nofollow\"><img alt='\"\"' src=\"%22https:/www.youtube.com/watch?v=cAYCOLpPLPE%22\"></a><a href=\"%22https:/www.youtube.com/watch?v=cAYCOLpPLPE%22\" rel=\"nofollow\" target='\"_blank\"'>https://www.youtube.com/watch?v=cAYCOLpPLPE</a> </p>\n<p><strong>✈️ Altium Benefits</strong><strong>: </strong><a href=\"%22https:/careers.altium.com/#s-benefits%22\" rel=\"nofollow\">https://careers.altium.com/#s-benefits</a> </p>\n<p><strong>👏 Are you already an Altium employee? </strong>Please apply directly through our <a href=\"%22https:/www.greenhouse.com/%22\" rel=\"nofollow\" target='\"_blank\"'>internal Greenhouse job board.</a> If you have questions, please contact HR.</p>\n</div>\n<img src=\"https://remotive.com/job/track/1993157/blank.gif?source=public_api\" alt=\"\"/>"
  },
  {
    "id": 1991106,
    "url": "https://remotive.com/remote-jobs/hr/senior-recruiter-1991106",
    "title": "Senior Recruiter",
    "company_name": "AirGarage",
    "company_logo": "https://remotive.com/job/1991106/logo",
    "category": "Human Resources",
    "tags": [
      "excel",
      "fullstack",
      "go",
      "advertising",
      "healthcare",
      "startup",
      "diversity"
    ],
    "job_type": "full_time",
    "publication_date": "2025-04-06T08:50:59",
    "candidate_required_location": "USA",
    "salary": "",
    "description": "<p style=\"min-height:1.5em\"><strong>About AirGarage </strong></p><p style=\"min-height:1.5em\">AirGarage is repurposing the 30% of real estate in the average American city currently dedicated to parking.</p><p style=\"min-height:1.5em\">We are building a future where real estate is digitized and can be transitioned from one use to another seamlessly on-demand, moving every piece of urban real estate toward its highest and best use.</p><p style=\"min-height:1.5em\">We are starting with the $131 billion US parking real estate market because it is one of the most offline and mismanaged commercial real estate asset types.</p><p style=\"min-height:1.5em\">As a full-stack parking operator, we automate the operation of parking lots and parking garages. We handle everything from advertising to collecting payments from drivers and enforcing against illegal parking. We already operate 300+ parking lots and parking garages across 35 US states and we are growing quickly.</p><p style=\"min-height:1.5em\">We are backed by top tier investors including Andreessen Horowitz, Floodgate, Founders Fund, and angel investors who have founded or worked at companies like Uber, Opendoor, Flexport, and more.<br><br>Want to learn more about AirGarage and the problem we're tackling? <br><br>Check out these podcasts: <br><a href=\"https://www.youtube.com/watch?v=AU0NkDK51E4\" rel=\"nofollow\" target=\"_blank\">https://www.youtube.com/watch?v=AU0NkDK51E4</a><br><a href=\"https://youtu.be/_8aM6NQHYiE?si=p5WIujBWUA1sG-b7\" rel=\"nofollow\" target=\"_blank\">https://youtu.be/_8aM6NQHYiE?si=p5WIujBWUA1sG-b7</a></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>THE ROLE 👩🏾‍💻</strong></p><p style=\"min-height:1.5em\">As our first Recruiter you will partner closely with our founders and company leaders to expand our excellent engineering, sales, and operations teams, as well as help us build out newer functions like product and marketing.</p><p style=\"min-height:1.5em\">You'll need experience in the entire recruiting cycle - from sourcing to closing candidates - and will need the ability to spot talented individuals at various levels of career experience from all types of backgrounds.</p><p style=\"min-height:1.5em\">You'll be the cornerstone of our recruiting team and will also have significant input into how we build our recruiting process and culture as we scale from dozens to hundreds of employees across the country over the coming years.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>WHAT YOU WILL DO 👷‍♀️</strong></p><ul style=\"\"><li style=\"\"><p style=\"min-height:1.5em\">Assist our Founders and leadership team in scaling our best in class team to better serve our customers.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Spend your days sourcing, contacting, and closing top tier talent across the US and around the world.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Ensure candidates understand what AirGarage is and how we have a unique opportunity as a technology company that interacts with the physical world to impact people's daily lives.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Own our recruiting process from end to end in the early days and help us build out a people team as we scale and our hiring needs increase.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Bring in candidates from a wide variety of sources and guide them through the stages of our hiring pipeline toward close.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Support with non-recruiting people related functions such as compensation planning, annual reviews, healthcare, and more.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>WHAT YOU NEED 👩🏼‍🎓</strong></p><ul style=\"\"><li style=\"\"><p style=\"min-height:1.5em\">3+ years of full cycle recruiting experience at an agency / staffing firm or at a fast growing start up.</p></li><li style=\"\"><p style=\"min-height:1.5em\">You're excited to build a talent function from the ground up (with the potential opportunity lead it down the line if you excel and grow in the role).</p></li><li style=\"\"><p style=\"min-height:1.5em\">You're experienced in and comfortable with handling the entire recruiting cycle, from sourcing to coordinating to helping close candidates.</p></li><li style=\"\"><p style=\"min-height:1.5em\">You find creative ways to to connect with talent and get a thrill from the daily hunt of sourcing hidden talent.</p></li><li style=\"\"><p style=\"min-height:1.5em\">You can partner with the leadership team to translate business needs into hiring goals.</p></li><li style=\"\"><p style=\"min-height:1.5em\">You pay attention to detail. You take pride in a clean recruiting pipeline. You obsess over staying on top of all candidates in process.</p></li><li style=\"\"><p style=\"min-height:1.5em\">You move fast. You constantly find areas of improvement. You know how to use tools &amp; technology to leverage your time and you know which tools are best for an early to mid stage company's needs.</p></li><li style=\"\"><p style=\"min-height:1.5em\">You are analytical and use numbers to track progress and identify issues.</p></li><li style=\"\"><p style=\"min-height:1.5em\">You have a passion for cultivating an exceptional candidate experience.</p></li><li style=\"\"><p style=\"min-height:1.5em\">You have an ability to discern a candidate's true talent and ability beyond just resume and title matching.</p></li><li style=\"\"><p style=\"min-height:1.5em\">You have experience closing senior candidates across go-to-market, product &amp; engineering roles.</p></li><li style=\"\"><p style=\"min-height:1.5em\">You can tell AirGarage's story in way that resonates with candidates.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>🚨 WHY THIS ROLE MAY NOT BE FOR YOU 🚨</strong></p><p style=\"min-height:1.5em\">Please review this section before applying. We are sharing this information up front because we don’t expect this job to be appealing to everybody and we do not want to waste your time if you are not on board with all of the following.</p><p style=\"min-height:1.5em\">Being the first recruiting hire at a high growth startup means many different things, but there is one thing above all that it certainly means: hiring success or failure is ultimately your responsibility.</p><p style=\"min-height:1.5em\">This will be a hard job. We work long hours at AirGarage, including nights and weekends when necessary, because we love what we do. You will be expected to do the same. We are growing fast but our hiring team is lean, so every day you will have new challenges and too much on your plate, but you’ll be expected to find a way to deliver anyways.</p><p style=\"min-height:1.5em\">Below are some of the reasons you might not want this job:</p><ul style=\"\"><li style=\"\"><p style=\"min-height:1.5em\">You are not excited about being the first (and only, for the time being) recruiting / people team member at an early stage company. You should not take this role if you are not comfortable defining your own process and expect to have a playbook handed to you, because there is no playbook in place today.</p></li><li style=\"\"><p style=\"min-height:1.5em\">You don’t want to be involved in the weeds on every hire, partnering closely with hiring managers to run the entire hiring process from beginning to end, including the nitty gritty tactical work of sourcing, scheduling interviews, creating offers, and everything else involved in running a successful hiring process.</p></li><li style=\"\"><p style=\"min-height:1.5em\">You don’t wake up every day feel energized to source the next great team member that will come to work at AirGarage. Hiring is an extremely rewarding treasure hunt of sorts, and if that isn’t what you live and breathe for and derive immense personal satisfaction from then you likely won’t feel fulfilled in this role.</p></li><li style=\"\"><p style=\"min-height:1.5em\">You aren’t comfortable handling people / HR tasks outside of simply recruiting on an as needed basis. We don’t currently have a dedicated people team so compensation planning, end of year reviews, healthcare, 401k, and more fall on to the plates of our Founders and leadership team currently. We’re ideally looking for someone that is comfortable flexible beyond recruiting (which will absolutely be your top priority and focus in this role) to make sure all of these other people related things are taken care of so we maintain a high level of satisfaction among our current team members.</p></li></ul><p style=\"min-height:1.5em\"><em>We understand that there's no such thing as a 'perfect' candidate. We're looking for someone passionate, with grit and determination, who is excited to face the challenges of a rapidly growing startup. AirGarage is the type of company where you can grow exponentially, and we encourage you to apply to us even if you don't 100% match the candidate description.</em></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">AirGarage is an Equal Opportunity Employer.  We celebrate diversity and are committed to creating an inclusive environment for all employees.  Candidates and employees are always evaluated based on merit, qualifications, and performance.  We will never discriminate on the basis of race, color, gender, national origin, ethnicity, veteran status, disability status, age, sexual orientation, gender identity, martial status, mental or physical disability, or any other legally protected status.</p><img src=\"https://remotive.com/job/track/1991106/blank.gif?source=public_api\" alt=\"\"/>"
  },
  {
    "id": 1992488,
    "url": "https://remotive.com/remote-jobs/finance-legal/finance-manager-1992488",
    "title": "Finance Manager",
    "company_name": "Covetrus, North America",
    "company_logo": "https://remotive.com/job/1992488/logo",
    "category": "Finance / Legal",
    "tags": [
      "risk management"
    ],
    "job_type": "full_time",
    "publication_date": "2025-04-06T08:50:55",
    "candidate_required_location": "USA",
    "salary": "$86,300.00-$123,300.00",
    "description": "<i>\n This description is a summary of our understanding of the job description. Click on 'Apply' button to find out more.\n</i>\n<br>\n<br>\n<p class=\"h2 tw-mt-4 remotive-text-bigger\">\n Role Description\n</p>\n<p>\n The Finance Manager supporting Net Working Capital and Cash is an important member of the Covetrus North America Finance team. This role will report to the VP-Finance, North America and work closely with the Company’s VP-Treasury, VP-Operations and Logistics Services, CAO, CFO, COO, and their respective teams.\n</p>\n<p>\n The successful candidate will:\n</p>\n<ul style=\"\">\n<li style=\"\">\n  Accurately forecast and report on the Company’s cash position.\n </li>\n<li style=\"\">\n  Partner with business leaders to deliver on targets and drive efficiencies in net working capital metrics.\n </li>\n<li style=\"\">\n  Contribute to policies and procedures, setting goals and targets.\n </li>\n<li style=\"\">\n  Help make better use of systems and identify opportunities to improve processes.\n </li>\n<li style=\"\">\n  Function and work remotely from home with the highest degree of personal and professional integrity consistent with Covetrus’ Mission and Values.\n </li>\n<li style=\"\">\n  Attend periodic team collaboration events in person when scheduled.\n </li>\n</ul>\n<p class=\"h2 tw-mt-4 remotive-text-bigger\">\n Qualifications\n</p>\n<ul style=\"\">\n<li style=\"\">\n  Bachelor’s degree in finance, economics, or a related field (Master's degree preferred).\n </li>\n<li style=\"\">\n  Certifications such as CPA, CFA, or CTP helpful, but not required.\n </li>\n<li style=\"\">\n  5+ years of experience in corporate finance or related finance roles working with cash, net working capital and capital spend preferably within global, publicly traded companies.\n </li>\n<li style=\"\">\n  Proficiency in treasury management systems and financial modeling.\n </li>\n<li style=\"\">\n  Demonstrated track record of building successful relationships with key business partners.\n </li>\n<li style=\"\">\n  Strong analytical, negotiation, and problem-solving skills.\n </li>\n<li style=\"\">\n  Ability to manage multiple priorities and maintain strong attention to detail.\n </li>\n<li style=\"\">\n  Strong communication and presentation skills both (oral and written) with both internal and external customers such as Board of Directors, senior management, business unit management.\n </li>\n<li style=\"\">\n  Must work well in a cross-functional, matrix environment; be able to lead projects and work with all levels of fellow team members while building consensus.\n </li>\n<li style=\"\">\n  Action-oriented with demonstrated analytical and hands-on tactical skills.\n </li>\n<li style=\"\">\n  Proficiency in Microsoft Word and PowerPoint; Strong Excel skills required; Must be comfortable working using Zoom, MS Teams and/or WebEx.\n </li>\n</ul>\n<p class=\"h2 tw-mt-4 remotive-text-bigger\">\n Requirements\n</p>\n<ul style=\"\">\n<li style=\"\">\n  Travel is limited; no more than 15% of travel time is expected for the position.\n </li>\n<li style=\"\">\n  Reasonable access to a major airport, solid Internet and phone connectivity is expected so the candidate can successfully work remotely.\n </li>\n</ul>\n<p class=\"h2 tw-mt-4 remotive-text-bigger\">\n Benefits\n</p>\n<ul style=\"\">\n<li style=\"\">\n  401k savings &amp; company match\n </li>\n<li style=\"\">\n  Paid time off\n </li>\n<li style=\"\">\n  Paid holidays\n </li>\n<li style=\"\">\n  Maternity leave\n </li>\n<li style=\"\">\n  Parental leave\n </li>\n<li style=\"\">\n  Military leave\n </li>\n<li style=\"\">\n  Other leaves of absence\n </li>\n<li style=\"\">\n  Health, dental, and vision benefits\n </li>\n<li style=\"\">\n  Health savings accounts\n </li>\n<li style=\"\">\n  Flexible spending accounts\n </li>\n<li style=\"\">\n  Life &amp; disability benefits\n </li>\n<li style=\"\">\n  Identity theft protection\n </li>\n<li style=\"\">\n  Pet insurance\n </li>\n<li style=\"\">\n  Certain positions may include eligibility for a short term incentive plan\n </li>\n</ul>\n<img src=\"https://remotive.com/job/track/1992488/blank.gif?source=public_api\" alt=\"\"/>"
  },
  {
    "id": 1992662,
    "url": "https://remotive.com/remote-jobs/devops/lead-devops-engineer-1992662",
    "title": "Lead DevOps Engineer",
    "company_name": "Protex AI",
    "company_logo": "https://remotive.com/job/1992662/logo",
    "category": "DevOps / Sysadmin",
    "tags": [
      "AWS",
      "SRE",
      "CI/CD",
      "infrastructure"
    ],
    "job_type": "full_time",
    "publication_date": "2025-04-06T08:50:52",
    "candidate_required_location": "Europe",
    "salary": "",
    "description": "<p style=\"min-height:1.5em\"><strong>About us:</strong></p><p style=\"min-height:1.5em\">Protex AI is a VC-backed technology company building a privacy-preserving computer vision platform to enable proactive Health and Safety (EHS) workflows. We leverage the domain knowledge of EHS teams to help our computer vision system understand the concept of danger, preventing accidents before they occur. Every worker has the right to go home safe and healthy every day and every employer has the responsibility to provide a safe work environment. Our mission at Protex AI is to ensure that this is the case in every facility around the world by empowering EHS teams to adopt proactive safety cultures and in doing so realise an injury-free workplace.</p><p style=\"min-height:1.5em\"></p><div class=\"h1\"><strong>About the Team</strong></div><p style=\"min-height:1.5em\">The Platform (Infrastructure) Team builds and maintains the core foundation that powers all Protex systems. We foster robust edge-to-cloud connectivity, creating scalable data infrastructure and high-performance backend services. Our team ensures strong edge deployments for real-time computer vision applications and delivers dependable systems that enable proactive workplace safety at global scale.</p><p style=\"min-height:1.5em\"></p><div class=\"h1\"><strong>About the Role</strong></div><p style=\"min-height:1.5em\">We’re looking for a Lead DevOps Engineer to lead infrastructure efforts across cloud and edge environments. You’ll architect and implement CI/CD pipelines, design scalable observability systems, and drive system reliability across globally distributed environments. You'll help shape a seamless developer experience, maintain environment parity (Dev, Stage, Prod), and ensure secure, high-quality data across all regions.  </p><p style=\"min-height:1.5em\">You’ll work closely with engineering teams to support well-architected, cost-effective, and secure infrastructure. This includes proactive cost management, cloud security enforcement, and compliance with regional standards like GDPR. </p><p style=\"min-height:1.5em\"></p><div class=\"h1\"><strong>What You'll Need</strong></div><ul style=\"\"><li style=\"\"><p style=\"min-height:1.5em\">8+ years of professional experience in DevOps, Infrastructure, or SRE roles</p></li><li style=\"\"><p style=\"min-height:1.5em\">Proven experience in SRE with a focus on uptime, reliability, and system health</p></li><li style=\"\"><p style=\"min-height:1.5em\">Expertise in monitoring, observability, and reliability best practices</p></li><li style=\"\"><p style=\"min-height:1.5em\">Demonstrated experience with CI/CD pipeline design and automation (cloud and edge)</p></li><li style=\"\"><p style=\"min-height:1.5em\">Experience with real-time, distributed, or IoT infrastructure</p></li><li style=\"\"><p style=\"min-height:1.5em\">Experience with Unix-based operating systems</p></li><li style=\"\"><p style=\"min-height:1.5em\">Hands-on experience with Kubernetes and Terraform</p></li><li style=\"\"><p style=\"min-height:1.5em\">Experience managing split environments (Dev, Staging, Prod) with consistent, production-quality data </p></li><li style=\"\"><p style=\"min-height:1.5em\">Ability to deploy infrastructure across regions while maintaining GDPR and other compliance standards</p></li><li style=\"\"><p style=\"min-height:1.5em\">Substantial knowledge of AWS services (e.g., Lambda, EC2, S3, CloudWatch)</p></li><li style=\"\"><p style=\"min-height:1.5em\">Demonstrated focus on developer experience and supporting cross-functional teams</p></li><li style=\"\"><p style=\"min-height:1.5em\">Demonstrated understanding of cloud security best practices (secrets management, threat prevention, vulnerability mitigation)</p></li><li style=\"\"><p style=\"min-height:1.5em\">Ability to influence technical direction, mentor others, and implement solutions</p></li><li style=\"\"><p style=\"min-height:1.5em\">Bachelor’s degree in Computer Science or a related field</p></li></ul><p style=\"min-height:1.5em\"></p><div class=\"h1\"><strong>Nice To Have</strong></div><ul style=\"\"><li style=\"\"><p style=\"min-height:1.5em\">Experience implementing best practices to improve DORA metrics</p></li><li style=\"\"><p style=\"min-height:1.5em\">Expertise in CI/CD pipeline development for edge deployments</p></li></ul><p style=\"min-height:1.5em\"></p><div class=\"h1\"><strong>Why Join Us</strong></div><p style=\"min-height:1.5em\">At Protex AI, you'll be part of a supportive team working on innovative challenges with a shared mission. We value both individual leadership and team collaboration, providing opportunities to make a meaningful impact on workplace safety around the world.</p><p style=\"min-height:1.5em\">Protex AI is an inclusive and equal opportunities employer. We are committed to creating an equitable workplace for everyone regardless of gender, civil status, family status, sexual orientation, religion, age, disability, education level, or race. </p><img src=\"https://remotive.com/job/track/1992662/blank.gif?source=public_api\" alt=\"\"/>"
  },
  {
    "id": 1992448,
    "url": "https://remotive.com/remote-jobs/marketing/marketing-specialist-1992448",
    "title": "Marketing Specialist",
    "company_name": "Boldr",
    "company_logo": "https://remotive.com/job/1992448/logo",
    "category": "Marketing",
    "tags": [
      "social media",
      "campaign management",
      "google ads",
      "Digital advertising"
    ],
    "job_type": "full_time",
    "publication_date": "2025-04-06T08:50:43",
    "candidate_required_location": "Philippines",
    "salary": "",
    "description": "<div class=\"h3\">A LITTLE BIT ABOUT Boldr</div>\n<ul style=\"\">\n<li style=\"\">Boldr is the first global B-Corp dedicated to delivering world-class Client experiences while creating access to dignified, meaningful work in communities around the world.</li>\n<li style=\"\">We are a global team united by our desire to connect diverse people with common values for boldr impact. </li>\n<li style=\"\">We employ just over a thousand team members across five countries and we want to employ over 5,000 people by 2027, if not sooner.</li>\n</ul>\n<div class=\"h3\">LET’S START WITH OUR VALUES</div>\n<ul style=\"\">\n<li style=\"\">Meaningful connections start with AUTHENTICITY</li>\n<li style=\"\">We do our best work by being CURIOUS</li>\n<li style=\"\">We grow by remaining DYNAMIC</li>\n<li style=\"\">Our success combines AMBITIOUS VISION with OPERATIONAL EXCELLENCE </li>\n<li style=\"\">At the heart of great partnerships, we’ll always find EMPATHY</li>\n</ul>\n<div class=\"h3\">WHAT IS YOUR ROLE</div>\n<p>As a <strong>Marketing Specialist/Digital Advertising Specialist</strong> you will focus on managing and optimizing employment ad campaigns across social media platforms and Google. You should have a strong understanding of digital advertising, a creative mindset for crafting compelling campaigns, and the ability to analyze performance data to ensure optimal results. While much of the media will be provided by clients, the successful candidate will be responsible for executing and refining the campaigns to drive success. Your role is integral to maintaining operational excellence and driving impactful marketing results. Additionally, <strong>you will be managing and optimizing Google Ads (including PMAX) and Meta Ads campaigns, tracking performance and turning visits into real conversions, and doing A/B testing creatives, copy, and audience targeting strategies.</strong></p>\n<div class=\"h3\">WHY DO WE WANT YOU</div>\n<p>We are currently looking for impact-driven individuals who are passionate about helping Boldr grow and achieve our Purpose. We expect our team to become our ultimate partners in success by always giving 110% in everything, sharing their talents and quirks, and championing our core values: Curious, dynamic, and authentic.</p>\n<div class=\"h3\">WHAT WILL YOU DO</div>\n<ul style=\"\">\n<li style=\"\">Create, manage, and optimize employment advertising campaigns on platforms such as Google Ads, Facebook, Instagram, and LinkedIn.</li>\n<li style=\"\">Ensure campaigns align with the client objectives, timelines, and budgets.</li>\n<li style=\"\">Monitor day-to-day performance of ad campaigns, adjusting targeting, bidding, and content as necessary to maximize ROI.</li>\n<li style=\"\">Collaborate with clients to understand their needs and utilize provided media assets effectively.</li>\n<li style=\"\">Develop engaging ad copy and headlines when needed to enhance campaign performance.</li>\n<li style=\"\">Leverage data analytics to assess the performance of campaigns and provide performance reports with actionable insights. Use this data to support decision-making within the marketing team and to align marketing activities with broader revenue objectives.</li>\n<li style=\"\">Perform research, analyses, and testing with a variety of tools to gain insights and shape marketing strategy.</li>\n<li style=\"\">Collaborate with team members to optimize automation and lead-nurturing processes through email, content, events, and social channels.</li>\n<li style=\"\">Assist in the execution of marketing plans to reach audiences through targeted channels.</li>\n<li style=\"\">Liaise with all stakeholders to guarantee adequate planning, execution, and monitoring of marketing campaign activities.</li>\n<li style=\"\">Stay up to date with digital advertising, market and online trends relevant to the brand to ensure campaigns and promotions are relevant within each market.</li>\n<li style=\"\">Maintain awareness of best practice marketing techniques/tools to achieve successful campaigns and promotions.</li>\n<li style=\"\">Troubleshoot and resolve any issues related to campaign performance or technical execution.</li>\n</ul>\n<p><strong>Requirements</strong></p>\n<div class=\"h3\">WHAT WE’LL LIKE ABOUT YOU</div>\n<p><strong> YOU ARE…</strong></p>\n<ul style=\"\">\n<li style=\"\">Curious and authentic, just like us! #beboldr </li>\n</ul>\n<ul style=\"\">\n<li style=\"\">A critical thinker with an eye for even the most minute of details</li>\n<li style=\"\">Passionate about the client experience </li>\n</ul>\n<p><strong>YOU HAVE…</strong></p>\n<ul style=\"\">\n<li style=\"\">3+ years of marketing specialist experience with proven experience managing digital advertising campaigns on social media and Google Ads</li>\n<li style=\"\">Bachelor's Degree in marketing, communications, or a similar relevant field</li>\n<li style=\"\">Strong analytical skills with the ability to interpret performance data and adjust strategies accordingly</li>\n<li style=\"\">Familiarity with tools such as Google Ads Manager, Facebook Ads Manager, and Google Analytics</li>\n<li style=\"\">Basic creative skills for crafting ad copy and headlines; design experience is a plus but not required</li>\n<li style=\"\">Exceptional attention to detail, organizational  and time management skills</li>\n<li style=\"\">In-depth knowledge of traditional and digital marketing and market research methods</li>\n<li style=\"\">Applicable knowledge of marketing data analytics and tools</li>\n<li style=\"\">Good project management skills and experience with project management tools would be a plus</li>\n<li style=\"\">Outstanding communication, interpersonal, and presentation skills</li>\n<li style=\"\">Excellent organizational and time management skills</li>\n</ul>\n<p><strong>Benefits</strong></p>\n<ul style=\"\">\n<li style=\"\">Private Health Insurance</li>\n<li style=\"\">Paid Time Off</li>\n<li style=\"\">Work From Home</li>\n<li style=\"\">Training &amp; Development</li>\n<li style=\"\">Mental Health Program</li>\n<li style=\"\">Government-mandated Benefits</li>\n</ul>\n<p><br><br></p>\n<div class=\"h2\">About the company</div>\n<p> </p>\n<p>Boldr is a global impact-driven organization that places immense value on our team members, the communities we operate in, and our esteemed clients. At the heart of our philosophy is the belief in fostering growth and fulfillment for our team members, aligning their interests and goals with meaningful career development opportunities.</p>\n<p>At Boldr, we take great pride in the diverse backgrounds, commitments, and passions that our team members bring to the table. This rich tapestry of perspectives and experiences contributes to our vibrant and inclusive company culture, which we wholeheartedly celebrate across our global teams.</p>\n<img src=\"https://remotive.com/job/track/1992448/blank.gif?source=public_api\" alt=\"\"/>"
  },
  {
    "id": 1992663,
    "url": "https://remotive.com/remote-jobs/devops/senior-infrastructure-engineer-1992663",
    "title": "Senior Infrastructure Engineer",
    "company_name": "Bonapolia",
    "company_logo": "https://remotive.com/job/1992663/logo",
    "category": "DevOps / Sysadmin",
    "tags": [
      "elasticsearch",
      "python",
      "bash",
      "SQL Server"
    ],
    "job_type": "full_time",
    "publication_date": "2025-04-06T06:51:29",
    "candidate_required_location": "Hungary, Poland, Romania, Lithuania, Bulgaria",
    "salary": "",
    "description": "<p>We’re looking for an <strong>Infrastructure Engineer </strong>to join our friendly team of professionals. A collaborative outlook and a willingness to pitch in and get the job done are essential characteristics for this position!</p>\n<p><strong> </strong></p>\n<p><strong>About Our Customer</strong></p>\n<p>The European company's customer offers a comprehensive, cloud-based Procure-to-Pay solution designed to streamline procurement, approvals, payments, and supplier collaboration.</p>\n<p> </p>\n<p><strong>Project Tech Stack</strong></p>\n<p>PowerShell, Bash, Python, .Net, SQL Server, Elasticsearch</p>\n<p> </p>\n<p><strong>Requirements</strong></p>\n<p>● Proficiency in <strong>PowerShell</strong>, Bash, and Python</p>\n<p>● Strong troubleshooting skills, ability to identify and fix problems at infrastructure layer </p>\n<p>● Experience with both Windows and Linux Environments, being able to automate tasks on the OS level and integrate with different apps through the use of PowerShell </p>\n<p>● Proactive approach to maintenance and improvement</p>\n<p>● Strong communication skills, ability to document solutions and processes</p>\n<p> </p>\n<p><strong>Responsibilities </strong></p>\n<p> </p>\n<p>● Designing and implementing infrastructure solutions </p>\n<p>● Managing and monitoring systems</p>\n<p>● Automation and scripting</p>\n<p>● Collaboration with development and operations teams</p>\n<p><br><br><br><br><br><br>👍<strong>English: </strong>upper-intermediate<br><strong><br></strong><strong><strong>🌍</strong></strong><strong> </strong><strong>Location: Bulgaria, Hungary, Lithuania, Poland, Romania</strong><br><br><br><br><br><strong>📩 Ready to Join?</strong><br>We look forward to receiving your application and welcoming you to our team!</p>\n<img src=\"https://remotive.com/job/track/1992663/blank.gif?source=public_api\" alt=\"\"/>"
  },
  {
    "id": 1992797,
    "url": "https://remotive.com/remote-jobs/data/analytics-engineer-ii-1992797",
    "title": "Analytics Engineer II",
    "company_name": "Spark Advisors",
    "company_logo": "https://remotive.com/job/1992797/logo",
    "category": "Data Analysis",
    "tags": [
      "python",
      "sql",
      "data visualization"
    ],
    "job_type": "full_time",
    "publication_date": "2025-04-06T06:51:24",
    "candidate_required_location": "USA",
    "salary": "$125,000 - $145,000 usd",
    "description": "<div class='\"content-intro\"'><div class=\"h2\" id='\"about-heading\"'>About Spark Advisors</div>\n<div class='\"external-panel__trix-content' id='\"about-body\"'></div>\n<p>We’re Spark, a mission-driven company helping independent Medicare brokers build the insurance business of their dreams. The vast majority of beneficiaries select benefits with the help of an independent broker, but technology and support for brokers is woefully antiquated. We provide workflows and services to help brokers achieve transformative growth.</p>\n<p>In just five years, we’ve partnered with over 6,000 brokers and enrolled over 140,000 beneficiaries, making us the fastest-growing Medicare brokerage in the country. Brokers love us: during this period of intense growth, we’ve maintained an NPS of 91 and a client retention rate of 93%, and we’ve helped brokers grow on average &gt;100% since partnering with us.</p>\n<p>It’s an exciting time to be at Spark. Our diverse, remote-first team comes from leading technology, healthcare, and insurance companies, and has grown from 70 to 90 in the last year. Most recently, we’ve raised a Series B from leading investors who share our ambition.</p>\n<p>Join us: we’re always on the lookout for sharp, talented, empathetic teammates.</p></div><p> </p>\n<div class=\"h2\">Summary</div>\n<p>Spark is seeking an Analytics Engineer II to join our data team. Historically, the medicare distribution industry has had a lack of transparency, but Spark is on a mission to change that. You can be a key part of the change by helping Spark and our customers wrangle, structure and draw valuable insights from a variety of data sources. </p>\n<p>In this role, you will be responsible for improving core datasets and building the pipelines that power our business. This work will enable Spark to create data-driven products for our customers and gain actionable insights into our business. As a key member of the Spark Data team, you'll collaborate closely with product, engineering, carrier relations, and other teams to deliver high-quality datasets.</p>\n<div class=\"h2\">What you’ll do</div>\n<ul style=\"\">\n<li style=\"\">Design, optimize, and maintain scalable ELT data pipelines using GCP tools, focusing on BigQuery and Dataform/dbt.</li>\n<li style=\"\">Automate and standardize data processes to improve efficiency, reduce manual effort, and ensure consistent data flow.</li>\n<li style=\"\">Partner with cross-functional teams to understand business needs and translate them into technical data solutions that support data-driven insights.</li>\n<li style=\"\">Mentor and upskill junior engineers, fostering a collaborative and growth-oriented environment.</li>\n<li style=\"\">Ensure data quality through rigorous testing, analysis, and continuous improvement of data processes.</li>\n<li style=\"\">Own and deliver medium-scale data projects, managing end-to-end execution and stakeholder communication.</li>\n</ul>\n<div class=\"h2\" id='\"skills-heading\"'>What we’re looking for</div>\n<ul style=\"\">\n<li style=\"\">4+ years of experience in data or analytics engineering.</li>\n<li style=\"\">Advanced proficiency in SQL and experience with DBT/Dataform for building scalable pipelines</li>\n<li style=\"\">Some exposure to Python and data visualization tools (e.g. Metabase, Hex, Tableau, PowerBI)</li>\n<li style=\"\">Detail-oriented with the ability to analyze complex data and draw conclusions even when faced with messy/incomplete data</li>\n<li style=\"\">Proven ability to automate data workflows using modern tools</li>\n<li style=\"\">Comfortable giving and receiving feedback on standardized processes to ensure quality and consistency</li>\n<li style=\"\">Strong communication skills for working cross-functionally with various teams</li>\n</ul>\n<div class=\"h2\">Nice to Haves</div>\n<ul style=\"\">\n<li style=\"\">Additional Python experience for data manipulation or automation</li>\n<li style=\"\">Familiarity with managing transformation tools and cloud resources in AWS/GCP</li>\n<li style=\"\">Background in analytics or business intelligence to drive insights from data</li>\n<li style=\"\">Experience with data warehousing, performance tuning, and large datasets</li>\n</ul>\n<div class=\"h2\">Compensation</div><div class='\"content-pay-transparency\"'><div class='\"pay-input\"'><div class='\"description\"'><p><em>Our salary ranges are based on paying competitively for our company’s size and industry, and are one part of the total compensation package that also includes equity, benefits, and other opportunities at Spark. In accordance with New York City, Colorado, California, and other applicable laws, Spark is required to provide a reasonable estimate of the compensation range for this role. Individual pay decisions are ultimately based on a number of factors, including qualifications for the role, experience level, skillset, geography, and balancing internal equity. A reasonable estimate of the current salary range is </em><em>listed below</em><em>. We expect most candidates to fall in the middle of the range. We also believe that your personal needs and preferences should be taken into consideration, so we allow some choice between equity and cash.</em></p></div><div class='\"title\"'>Base Salary</div><div class='\"pay-range\"'><span>$125,000</span><span class='\"divider\"'>—</span><span>$145,000 USD</span></div></div></div><div class='\"content-conclusion\"'><section class='\"pinpoint-block'>\n<div class='\"external-content-wrap\"'>\n<div class='\"careers-block__inner\"'>\n<div class='\"frow'>\n<div class='\"col-1-1'>\n<p><strong>Why you should join our team</strong></p>\n<p>By joining Spark, you will get in on the ground floor of a fast-moving, well-funded, and mission-driven startup where you will have a profound impact on the brokers and beneficiaries we serve. And you'll learn, grow, be challenged, and have fun with your team while doing it.</p>\n<p>We strive to help you and your family thrive. We're committed to supporting your happiness, healthiness, and overall well-being by providing a comprehensive benefits program. In addition to your base salary, we also offer:</p>\n<ul style=\"\">\n<li style=\"\">Equity compensation</li>\n<li style=\"\">Health care, including dental and vision through our PEO Sequoia</li>\n<li style=\"\">Flexible work location; co-working available</li>\n<li style=\"\">401k</li>\n<li style=\"\">Paid Time Off</li>\n<li style=\"\">Monthly Remote Work Stipend (help cover costs of home-office needs)</li>\n<li style=\"\">Paid Parental Leave</li>\n<li style=\"\">Up to 12 weeks for birthing parents</li>\n<li style=\"\">Up to 8 weeks for non-birth parents</li>\n<li style=\"\">11 paid holidays</li>\n<li style=\"\">2 week sabbatical at 5 years of employment </li>\n<li style=\"\">Wellbeing Perks through SpringHealth, OneMedical, PerkSpot, and SoFi</li>\n</ul>\n<p><strong>Compliance </strong></p>\n<p>Spark is a proud participant in E-Verify. As part of our commitment to compliance, we use the E-Verify program to confirm the employment eligibility of all employees working in the United States. For more information about E-Verify, please visit<a href=\"%22https://www.e-verify.gov/%22\" rel=\"nofollow\"> </a><a href=\"%22http://www.e-verify.gov%22\" rel=\"nofollow\">www.e-verify.gov</a>.</p>\n<p>Furthermore, for security and compliance requirements, we’re unable to accommodate international remote work. While we fully support travel and time off, all work must be conducted from an approved location within the U.S.</p>\n<p>At Spark, we are committed to hiring the best team to serve our clients regardless of their background. We need diverse perspectives to reflect the diversity of our problems and the population we serve. We look to hire people from a variety of backgrounds, including, but not limited to, race, age, sexual orientation, gender identity and expression, national origin, religion, disability, and veteran status.</p>\n</div>\n</div>\n</div>\n</div>\n</section></div><img src=\"https://remotive.com/job/track/1992797/blank.gif?source=public_api\" alt=\"\"/>"
  },
  {
    "id": 1992537,
    "url": "https://remotive.com/remote-jobs/customer-support/experience-partner-1992537",
    "title": "Experience Partner",
    "company_name": "Granicus",
    "company_logo": "https://remotive.com/job/1992537/logo",
    "category": "Customer Service",
    "tags": [
      "cloud",
      "security",
      "CX",
      "information security",
      "business development",
      "digital content",
      "diversity",
      "travel",
      "insurance",
      "mental health"
    ],
    "job_type": "full_time",
    "publication_date": "2025-04-06T06:51:06",
    "candidate_required_location": "USA",
    "salary": "$80,000-$90,000 usd",
    "description": "<div><strong style=\"\">The Company </strong></div>\n<div><strong style=\"\">Serving the People Who Serve the People </strong></div>\n<div> </div>\n<div><span style=\"\">Granicus is driven by the excitement of building, implementing, and maintaining technology that is transforming the Govtech industry by bringing governments and its constituents together. We are on a mission to support our customers with meeting the needs of their communities and implementing our technology in ways that are equitable and inclusive. Granicus has consistently appeared on the GovTech 100 list over the past 5 years and has been recognized as the best companies to work on BuiltIn.  </span></div>\n<div> </div>\n<div><span style=\"\">Over the last 25 years, we have served 5,500 federal, state, and local government agencies and more than 300 million citizen subscribers power an unmatched Subscriber Network that use our digital solutions to make the world a better place. With comprehensive cloud-based solutions for communications, government website design, meeting and agenda management software, records management, and digital services, Granicus empowers stronger relationships between government and residents across the U.S., U.K., Australia, New Zealand, and Canada. By simplifying interactions with residents, while disseminating critical information, Granicus brings governments closer to the people they serve—driving meaningful change for communities around the globe. </span></div>\n<div><span style=\"\">Want to know more? See more of what we do </span><a class=\"postings-link\" href=\"http://www.granicus.com/\" rel=\"nofollow\" style=\"\">here</a><span style=\"\">.  </span></div>\n<div> </div>\n<div>At Granicus, we understand that public interest technology isn't a one-size-fits-all solution. That's why we developed the Government Experience Cloud — a purpose-built platform to enhance internal and external operations, community engagement, resident services, and trust in government. Acknowledging that technology alone isn't enough to drive change, our skilled experience design agency, efficient technology implementation practices, and robust data-driven insights catalyze meaningful change in communities worldwide. Our unwavering commitment to the power of people, process, and technology sets us apart, enabling us to deliver excellence consistently. </div>\n<div> </div>\n<div>Our Experience Partners have strong experience in customer-facing environments. They are CX practitioners and delivery experts across the portfolio of Granicus services, technology, and data solutions, responsible for developing and articulating comprehensive experience proposals. Ideal candidates have experience as a human-centered design practitioner, data-driven analyst, digital content creator, technology strategist, program manager, business development manager, account manager and/or customer relationship manager. </div>\n<div> </div>\n<div>Our Experience Partners are involved during pre-sales and lead post-sales activities. They will maintain the executive relationships with their customers and act as a main contact for the programs they own, ensuring tight alignment, offering proactive and prescriptive advice, and ultimately resulting in outstanding Customer Success. This may include the following:</div>\n<div>·       Pre-sales alignment and experience definition.</div>\n<div>·       Project kickoff.</div>\n<div>·       Bringing industry expertise and perspective.</div>\n<div>·       Drive better outcomes through extensive experience, services, data, and technical expertise.</div>\n<div>·       Deep understanding of Granicus solutions.</div>\n<div>·       Alignment to and support of customer objectives.</div>\n<div>·       Regular customer check-ins.</div>\n<div>·       Ensure project operational compliance.</div>\n<div>·       Executive Relationship building.</div>\n<div>·       Owning their book of business, constituted by programs across an assigned set of customers.</div>\n<div>·       Being customer's primary Point of Contact for owned programs.</div>\n<div>·       Protect existing program revenues and prevent/mitigate program and customer churn.</div>\n<div>·       Grow revenues through direct upsells within the programs and generating cross-selling leads.</div>\n<p><br><br></p>\n<div class=\"h3\">What Your Impact Will Look Like Here</div>\n<ul style=\"\">\n<li style=\"\">Develop, grow, and manage strategic customer relationships.</li>\n<li style=\"\">Create and deliver effective presentations and proposals to address the specific needs of a customer or prospect.  </li>\n<li style=\"\">Work with customers to identify and align programs, agency, or mission objectives to improve CX outcomes. </li>\n<li style=\"\">Design &amp; deliver strategic program reviews to infuse CX subject matter expertise and develop relationships with agency’s executive stakeholders.</li>\n<li style=\"\">Identify and develop customer engagement and recognition opportunities.</li>\n<li style=\"\">Drive organic growth by leveraging our current book of business and relationships.</li>\n<li style=\"\">Work with customer to create demand for Granicus services and solutions.</li>\n<li style=\"\">Collaborate with Granicus leadership to shape development of new services based on customer demand and insight.</li>\n<li style=\"\">Serve as the voice of the customer, bringing their needs and concerns back into the company to inform our solutions and processes.</li>\n<li style=\"\">Represent Granicus in speaking roles, panel participation, and internal or external engagements. </li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">You will love this job if you have</div>\n<ul style=\"\">\n<li style=\"\">2-3 years of experience in digital services, managing a portfolio of projects, including delivery, quality assurance, and growth of programs, preferably with an understanding of human-centered design best practices and approaches. </li>\n<li style=\"\">Ability to serve as a trusted, strategic adviser to top professionals.</li>\n<li style=\"\">Demonstrated commercial acumen and successful track record of customer or project P&amp;L management. </li>\n<li style=\"\">Passion for public service, citizen engagement, service transformation and communication.</li>\n<li style=\"\">Exceptional interpersonal skills for internal and external relationship building at all levels of the organization, including cross-departmental colleagues and customers.</li>\n<li style=\"\">Self-motivated, flexible problem solver, who can keep the trains running (managing the routine) but can also adapt quickly and find alternative ways to get the work done.</li>\n<li style=\"\">Exceptional interpersonal skills for internal and external relationship-building.</li>\n<li style=\"\">Ability to thrive in a lean, self-propelling, proactive environment.</li>\n<li style=\"\">Commitment to diversity of thought and consideration of different ideas. </li>\n<li style=\"\">Prior to the shutdown for the Covid-19 pandemic, CXS staff were expected to be available for on-site customer meetings. This included travel in some instances. As our customers' expectations and responses to the pandemic continue to evolve, CXS team members may once again be expected to be available for in-person customer meetings.</li>\n</ul>\n<div>Potential base salary. Does not include bonus OR commission and benefits.</div>\n<div>COMPENSATION RANGE: $80,000-$90,000 USD</div>\n<div> </div>\n<div>Don’t have all the skills/experience mentioned above? At Granicus, we are trying to build diverse, inclusive teams. We do not have degree requirements for most of our roles. If you don’t meet every requirement above, but are excited to learn more, we encourage you to apply. We might just be able to find another role that could be a perfect fit! </div>\n<div> </div>\n<div><strong>Security and Privacy Requirements</strong></div>\n<div>1. Responsible for Granicus information security by appropriately preserving the Confidentiality, Integrity, and Availability (CIA) of Granicus information assets in accordance with the company's information security program.</div>\n<div>2. Responsible for ensuring the data privacy of our employees and customers, their data, as well as taking all required privacy training in a timely manner, in accordance with company policies. </div>\n<div> </div>\n<div><span style=\"\"> </span></div>\n<div><span style=\"\">Don’t have all the skills/experience mentioned above? At Granicus, we are trying to build diverse, inclusive teams. We do not have degree requirements for most of our roles. If you don’t meet every requirement above but are excited to learn more, we encourage you to apply. We might just be able to find another role that could be a perfect fit! </span></div>\n<div> </div>\n<div><strong>Security and Privacy Requirements</strong></div>\n<div>-     Responsible for Granicus information security by appropriately preserving the Confidentiality, Integrity, and Availability (CIA) of Granicus information assets in accordance with the company's information security program.</div>\n<div>-     Responsible for ensuring the data privacy of our employees and customers, their data, as well as taking all required privacy training in a timely manner, in accordance with company policies.</div>\n<div><strong><span style=\"\">The Team</span></strong></div>\n<div><span style=\"\">- We are a remote-first company with a globally distributed workforce across the United States, Canada, United Kingdom, India, Armenia, Australia, and New Zealand.</span></div>\n<div> </div>\n<div><strong><span style=\"\">The Culture</span></strong></div>\n<div><span style=\"\">- At Granicus, we are building a transparent, inclusive, and safe space for everyone who wants to be </span></div>\n<div><span style=\"\"> a part of our journey. </span></div>\n<div><span style=\"\">- A few culture highlights include – Employee Resource Groups to encourage diverse voices</span></div>\n<div><span style=\"\">- Coffee with Mark sessions – Our employees get to interact with our CEO on very important and </span></div>\n<div><span style=\"\"> sometimes difficult issues ranging from mental health to work-life balance and current affairs. </span></div>\n<div><span style=\"\">- Microsoft Teams communities focused on wellness, art, furbabies, family, parenting, and more.-=- - We bring in special guests from time to time to discuss issues that impact our employee </span></div>\n<div><span style=\"\"> population </span></div>\n<div> </div>\n<div><strong><span style=\"\">The Impact</span></strong></div>\n<div><span style=\"\">- We are proud to serve dynamic organizations around the globe that use our digital solutions to make the world a better place — quite literally. We have so many powerful success stories that illustrate how our solutions are impacting the world. See more of our impact </span><a class=\"postings-link\" href=\"https://granicus.com/success-stories/\" rel=\"nofollow\" style=\"\">here</a><span style=\"\">.</span></div>\n<div> </div>\n<div><strong style=\"\">The Benefits</strong><span style=\"\"> </span></div>\n<div> </div>\n<div><span style=\"\">At Granicus, we offer a competitive benefits package that allows employees to tailor benefits to their needs. Benefits listed below are for employees based in the U.S.</span></div>\n<div> </div>\n<div><span style=\"\">- Flexible Time Off</span></div>\n<div><span style=\"\">- Medical (includes an option that is paid 100% by Granicus!), Dental &amp; Vision Insurance</span></div>\n<div><span style=\"\">- 401(k) plan with matching contribution</span></div>\n<div><span style=\"\">- Paid Parental Leave</span></div>\n<div><span style=\"\">- Employer-paid Short and Long Term Disability Insurance, Group Term Life Insurance and AD&amp;D Insurance</span></div>\n<div><span style=\"\">- Group legal coverage </span></div>\n<div><span style=\"\">- And more!</span></div>\n<div> </div>\n<div> </div>\n<div><em style=\"\">Granicus is committed to providing equal employment opportunities. All qualified applicants and employees will be considered for employment and advancement without regard to race, color, religion, creed, national origin, ancestry, sex, gender, gender identity, gender expression, physical or mental disability, age, genetic information, sexual or affectional orientation, marital status, status with regard to public assistance, familial status, military or veteran status or any other status protected by applicable law.</em><span style=\"\"> </span></div>\n<img src=\"https://remotive.com/job/track/1992537/blank.gif?source=public_api\" alt=\"\"/>"
  },
  {
    "id": 1992538,
    "url": "https://remotive.com/remote-jobs/customer-support/customer-support-representative-1992538",
    "title": "Customer Support Representative",
    "company_name": "Intento",
    "company_logo": "https://remotive.com/job/1992538/logo",
    "category": "Customer Service",
    "tags": [
      "html"
    ],
    "job_type": "full_time",
    "publication_date": "2025-04-06T06:51:05",
    "candidate_required_location": "USA timezones",
    "salary": "",
    "description": "<p><span style=\"color: #121317;\">Intento builds a Machine Translation and multilingual Generative AI platform for global businesses. We deliver immediate, tailored, and personalized language experience in all the software systems your customers and teammates already use, supporting over 650 languages.</span></p>\n<p><span style=\"color: #121317;\"><br>We are seeking an exceptional 1ts line Customer Support Representative to join our team and actively contribute to our growth and success. This is a fully remote position, and we consider candidates from the US timezone.</span></p>\n<p><span style=\"color: #121317;\"><br></span><strong><span style=\"color: #121317;\">About Intento:<br></span></strong><span style=\"color: #121317;\">Founded by two PhDs in AI, Intento is a fast-growing company with sky-high perspectives for proactive professionals.</span></p>\n<p><span style=\"color: #121317;\">Our clients are top enterprise companies from Europe, the USA, and Asia. We are recognized by global experts like OpenAI and Gartner, and we cooperate with the largest AI providers.</span></p>\n<p><span style=\"color: #121317;\">Intento now is 70+ people working remotely from different parts of the world (from Asia to the USA). The Head office is in Berkeley, USA.</span></p>\n<p><span style=\"color: #121317;\">We are looking for:<br><br></span><strong><span style=\"color: #121317;\">Hard skills:</span></strong></p>\n<ul class=\"ak-ul\" style=\"\">\n<li style=\"\">\n<p><span style=\"color: #121317;\">Fluent English (both </span><strong><span style=\"color: #121317;\">written and spoken</span></strong><span style=\"color: #121317;\">)</span></p>\n</li>\n<li style=\"\">\n<p><span style=\"color: #121317;\">Solid background in </span><strong><span style=\"color: #121317;\">Customer Support</span></strong><span style=\"color: #121317;\"> in a </span><strong><span style=\"color: #121317;\">technical product</span></strong><span style=\"color: #121317;\">, ideally within IT/SaaS for </span><strong><span style=\"color: #121317;\">US or EU markets</span></strong></p>\n</li>\n<li style=\"\">\n<p><span style=\"color: #121317;\">Working knowledge of </span><strong><span style=\"color: #121317;\">HTML</span></strong><span style=\"color: #121317;\">, </span><strong><span style=\"color: #121317;\">RESTful APIs</span></strong><span style=\"color: #121317;\">, and </span><strong><span style=\"color: #121317;\">basic debugging/troubleshooting</span></strong></p>\n</li>\n<li style=\"\">\n<p><span style=\"color: #121317;\">Experience with </span><strong><span style=\"color: #121317;\">localization processes</span></strong><span style=\"color: #121317;\">, working with multilingual or international user bases (a big plus!)</span></p>\n</li>\n</ul>\n<ul class=\"ak-ul\" style=\"\">\n<li style=\"\">\n<p><strong><span style=\"color: #121317;\">Soft skills:</span></strong></p>\n<ul class=\"ak-ul\" style=\"\">\n<li style=\"\">\n<p><span style=\"color: #121317;\">Clear, confident, and empathetic communicator</span></p>\n</li>\n<li style=\"\">\n<p><span style=\"color: #121317;\">Positive and proactive mindset</span></p>\n</li>\n<li style=\"\">\n<p><span style=\"color: #121317;\">High </span><strong><span style=\"color: #121317;\">emotional intelligence</span></strong><span style=\"color: #121317;\">—you know when to listen, when to explain, and how to de-escalate</span></p>\n</li>\n<li style=\"\">\n<p><span style=\"color: #121317;\">Self-starter with </span><strong><span style=\"color: #121317;\">a bias toward ownership and problem-solving</span></strong></p>\n</li>\n<li style=\"\">\n<p><span style=\"color: #121317;\">Collaborative team player who thrives in fast-paced environments<br></span></p>\n</li>\n</ul>\n</li>\n<li style=\"\">\n<p><strong><span style=\"color: #121317;\">Preferred: </span></strong></p>\n<ul class=\"ak-ul\" style=\"\">\n<li style=\"\">\n<p><span style=\"color: #121317;\">Familiarity with Zendesk, Intercom, Jira, or other support/dev tools</span></p>\n</li>\n<li style=\"\">\n<p><span style=\"color: #121317;\">Previous experience with localization QA or coordinating with localization teams</span></p>\n</li>\n<li style=\"\">\n<p><span style=\"color: #121317;\">Comfort with remote tools and asynchronous communication</span></p>\n</li>\n</ul>\n</li>\n</ul>\n<p style=\"min-height: 1.7em;\"> </p>\n<p><strong><span style=\"color: #121317;\">Responsibilities</span></strong><span style=\"color: #121317;\">:</span></p>\n<ul class=\"ak-ul\" style=\"\">\n<li style=\"\">\n<p><span style=\"color: #121317;\">Act as the first point of contact for customers via </span><strong><span style=\"color: #121317;\">email</span></strong></p>\n</li>\n<li style=\"\">\n<p><span style=\"color: #121317;\">Troubleshoot and resolve a variety of technical issues (simple to complex) efficiently and clearly</span></p>\n</li>\n<li style=\"\">\n<p><span style=\"color: #121317;\">Work closely with our </span><strong><span style=\"color: #121317;\">Development and Product</span></strong><span style=\"color: #121317;\"> teams to escalate bugs and technical challenges</span></p>\n</li>\n<li style=\"\">\n<p><span style=\"color: #121317;\">Document recurring issues and contribute to our </span><strong><span style=\"color: #121317;\">Knowledge Base</span></strong></p>\n</li>\n<li style=\"\">\n<p><span style=\"color: #121317;\">Ensure a smooth experience for users across different regions</span></p>\n</li>\n<li style=\"\">\n<p><span style=\"color: #121317;\">Continuously look for ways to improve customer satisfaction, resolution speed, and communication style<br></span></p>\n<p style=\"min-height: 1.7em;\"> </p>\n</li>\n</ul>\n<p style=\"text-align: start;\"><strong><span style=\"color: #121317;\">Why Join Us?</span></strong></p>\n<p style=\"text-align: start;\"><span style=\"color: #121317;\">At Intento, we are redefining the future of multilingual AI. Join us and be a part of this groundbreaking journey where innovation meets excellence.</span></p>\n<ul style=\"\">\n<li style=\"\">\n<p><span style=\"color: #121317;\">Collaborate with over 75+ talented individuals working remotely from various parts of the world, bringing diverse perspectives and ideas.</span></p>\n</li>\n<li style=\"\">\n<p><span style=\"color: #121317;\">Be part of a team dedicated to solving significant industrial problems using cutting-edge AI technology.</span></p>\n</li>\n<li style=\"\">\n<p><span style=\"color: #121317;\">Experience transparency in our business strategies, enabling you to understand the big picture and contribute in a meaningful way.</span></p>\n</li>\n<li style=\"\">\n<p><span style=\"color: #121317;\">Balance autonomy and responsibility, empowering you to make decisions and take ownership of your work.</span></p>\n</li>\n<li style=\"\">\n<p><span style=\"color: #121317;\">Benefit from competitive salaries that reflect your skills and expertise.</span></p>\n</li>\n<li style=\"\">\n<p><span style=\"color: #121317;\">We value our employees and strive to create an environment that promotes collaboration, flexibility, and growth.</span></p>\n</li>\n<li style=\"\">\n<p><span style=\"color: #121317;\">Gain firsthand experience deploying solutions to Fortune 500 companies, providing valuable insights into enterprise-level operations.</span></p>\n</li>\n</ul>\n<p style=\"text-align: start;\"><span style=\"color: #121317;\"><br>Join Intento and help drive the future of language technology while making a global impact!</span></p>\n<p style=\"text-align: start; min-height: 1.7em;\"> </p>\n<p style=\"text-align: start;\"><strong><span style=\"color: #434343;\">If you don't see that this role matches your skills and ambitions well, but you are still interested in exploring future opportunities at Intento, we’d love to hear from you! Please submit your resume and a brief cover letter, highlighting your key areas of expertise, preferred roles, and career goals, to </span></strong><a href=\"mailto:talentpool@inten.to\" rel=\"nofollow\" target=\"_blank\">talentpool@inten.to</a><span style=\"color: #434343;\">.</span><strong><span style=\"color: #434343;\"> To help us easily identify your submission, kindly use \"Intento Talent Pool\" as the subject line of your email.</span></strong></p>\n<img src=\"https://remotive.com/job/track/1992538/blank.gif?source=public_api\" alt=\"\"/>"
  },
  {
    "id": 1992342,
    "url": "https://remotive.com/remote-jobs/sales-business/territory-manager-1992342",
    "title": "Territory Manager",
    "company_name": "Aya Healthcare",
    "company_logo": "https://remotive.com/job/1992342/logo",
    "category": "Sales / Business",
    "tags": [
      "saas"
    ],
    "job_type": "full_time",
    "publication_date": "2025-04-06T04:50:06",
    "candidate_required_location": "USA",
    "salary": "$75,000 to $85,000 annually, plus commission",
    "description": "<p><span>Join Aya Healthcare, winner of multiple Top Workplace awards!</span><span> </span></p>\n<p><span>CoreHire is an innovative online platform that connects job seekers to exceptional career opportunities, with a primary focus on the healthcare industry through Aya's niche job board.</span><span> We match skilled clinical and non-clinical professionals with companies seeking top talent. As a fast-growing, technology-driven company, we are seeking a motivated Sales Specialist with strong relationship-building skills to join our team and contribute to our success.  </span> </p>\n<p><span><strong>Please note</strong> that this remote position requires the employee to be based in the <strong>Midwest</strong>. </span></p>\n<p><span>The Territory Manager for CoreHire will focus on driving sales and fostering business growth. To succeed in this role, you must effectively communicate product and service details clearly and concisely. The ideal candidate will possess strong problem-solving abilities, exceptional interpersonal skills, and advanced technological proficiency. You'll be responsible for explaining the platform's features and demonstrating how it can address the hiring challenges of potential clients. </span></p>\n<p><strong><span>Who We Are: </span></strong><span> </span></p>\n<p><span>We’re a $10+ billion, rapidly growing workforce solutions provider in the healthcare industry. We deliver tech-enabled services that help healthcare organizations meet and manage their contingent labor needs. We build and manage tech-enabled marketplaces for national and local healthcare talent and deliver contingent labor management solutions through our proprietary software platform.</span><span> </span></p>\n<p><span>At Aya, we’re obsessed with creating exceptional experiences for our clients, clinicians, and employees. In fact, we put employee satisfaction above all else. Our team members are responsible for incomparable customer experience and we know that happy employees are critical to maintaining happy clients. We foster an entrepreneurial, high-energy, low-bureaucracy culture and value innovative thinking and creative problem solving. We embrace diversity in thought and backgrounds unified by a commitment to high achievement. When you join Aya, you’ll be surrounded by teammates who care about you as an individual and leaders who will help you grow both personally and professionally.</span><span> </span></p>\n<p><strong><span>Responsibilities: </span></strong><span> </span></p>\n<ul style=\"\">\n<li style=\"\"><span>Develop and cultivate relationships that result in new contracts for Aya Healthcare</span><span> </span></li>\n<li style=\"\"><span>Convey Aya Healthcare’s unique value proposition to key decision makers within potential new hospital accounts in order to secure new business for CoreHire </span><span> </span></li>\n<li style=\"\">Demonstrate and effectively present Aya Healthcare’s CoreHire software to healthcare organizations</li>\n<li style=\"\">Identify and contact healthcare organizations in order to win their business </li>\n<li style=\"\">Build and maintain an active pipeline of prospective clients</li>\n<li style=\"\">Educate prospective healthcare organizations about Aya's differentiated services and software</li>\n<li style=\"\">Generate leads through various channels, strategic planning and referrals</li>\n<li style=\"\">Serve as the advocate for clients to ensure satisfaction with all company services and products</li>\n<li style=\"\">Coordinate sales email campaigns to potential, current, and former clients<span> </span></li>\n</ul>\n<p><strong><span>Required Qualifications:</span></strong><span> </span></p>\n<ul style=\"\">\n<li style=\"\"><span>Bachelor’s degree</span></li>\n<li style=\"\">2+ years as a top producer in sales within a Healthcare staffing organization is required</li>\n<li style=\"\">SaaS sales experience is preferred</li>\n<li style=\"\">Excellent oral and written communication</li>\n<li style=\"\">Proven self-starter with energy and motivation to find, develop, and close sales. <span> </span></li>\n<li style=\"\">Must be results-oriented and driven by both financial and career opportunities</li>\n<li style=\"\">Ability to succeed in a competitive selling environment</li>\n<li style=\"\">Ability to effectively communicate with peers as well as executive level management</li>\n<li style=\"\">Ability to establish cross functional and multi-level relationships with both internal team members and external customers</li>\n<li style=\"\">Ability to plan, prioritize, and organize effectively</li>\n<li style=\"\">Flexibility and willingness to adapt in a fast-paced environment<span> </span></li>\n</ul>\n<p><strong>What We Offer:</strong> </p>\n<ul style=\"\">\n<li style=\"\">Free premium medical, dental, life and vision insurance </li>\n<li style=\"\">Generous 401(k) match </li>\n<li style=\"\">Aya also offers other benefits to those that are eligible and where required by applicable law, including reimbursements and discretionary bonuses </li>\n<li style=\"\">Aya provides paid sick leave in accordance with all applicable state, federal, and local laws. Aya’s general sick leave policy is that employees accrue one hour of paid sick leave for every 30 hours worked. However, to the extent any provisions of the statement above conflict with any applicable paid sick leave laws, the applicable paid sick leave laws are controlling </li>\n<li style=\"\">Celebrations! We hit our goals and reward ourselves.  </li>\n<li style=\"\">Company-sponsored virtual events, happy hours and team-building activities are always on the horizon — plus, you get a special treat on your birthday! </li>\n<li style=\"\">Unlimited DTO — we believe in time off!  </li>\n<li style=\"\">Virtual yoga, meditation or boot camp classes offered daily </li>\n</ul>\n<p><strong>Compensation</strong>: <span>Aya reasonably anticipates the pay scale for this position to be </span><em><span>$36.06 to $40.86</span></em><span> hourly, which equates to</span> be $75,000 to $85,000 annually, plus commission.   </p>\n<p>The pay scale for this position may vary if applicant possesses experience outside of what Aya reasonably anticipates for this position. Bonuses are subject to the role and your manager’s discretion. </p>\n<p>Aya is an Equal Opportunity Employer (EEO), including Disability / Vets, and welcomes all to apply. Please click <a href=\"%22https://www.ayahealthcare.com/Content/pdfs/eeo-policy.pdf%22\" rel=\"nofollow\">here</a><a href=\"%22http://www.ayahealthcare.com/Content/pdfs/eeo-policy.pdf%22\" rel=\"nofollow\"> </a>for our EEO policy.</p><img src=\"https://remotive.com/job/track/1992342/blank.gif?source=public_api\" alt=\"\"/>"
  },
  {
    "id": 1992035,
    "url": "https://remotive.com/remote-jobs/all-others/manager-of-payor-contracting-1992035",
    "title": "Manager of Payor Contracting",
    "company_name": "SonderMind (all cities) ",
    "company_logo": "https://remotive.com/job/1992035/logo",
    "category": "All others",
    "tags": [
      "healthcare",
      "partnerships",
      "travel",
      "insurance",
      "mental health"
    ],
    "job_type": "full_time",
    "publication_date": "2025-04-06T02:51:20",
    "candidate_required_location": "USA",
    "salary": "$120,000 - $135,000 per year",
    "description": "<div class=\"h2\"><span class='\"s1\"'><strong>About SonderMind</strong></span></div>\n<p class='\"p2\"'>At<span class='\"s2\"'><span class='\"Apple-converted-space\"'>  </span></span>SonderMind,<span class='\"s2\"'><span class='\"Apple-converted-space\"'>  </span></span>we<span class='\"s2\"'><span class='\"Apple-converted-space\"'>  </span></span>know<span class='\"s3\"'><span class='\"Apple-converted-space\"'>  </span></span>that<span class='\"s3\"'><span class='\"Apple-converted-space\"'>  </span></span>therapy<span class='\"s3\"'><span class='\"Apple-converted-space\"'>  </span></span>works.<span class='\"s3\"'><span class='\"Apple-converted-space\"'>  </span></span>SonderMind<span class='\"s3\"'><span class='\"Apple-converted-space\"'>  </span></span>provides<span class='\"s3\"'><span class='\"Apple-converted-space\"'>  </span></span>accessible, personalized<span class='\"s3\"'><span class='\"Apple-converted-space\"'>  </span></span>mental healthcare that produces high-quality outcomes for patients. SonderMind's individualized approach to care starts with using innovative technology to help people not just ﬁnd a therapist, but ﬁnd the right, in-network therapist for them, should they choose to use their insurance. From there, SonderMind's clinicians are committed to delivering best-in-class care to all patients by focusing on high-quality clinical<span class='\"s2\"'><span class='\"Apple-converted-space\"'>  </span></span>outcomes.<span class='\"s2\"'><span class='\"Apple-converted-space\"'>  </span></span>To<span class='\"s2\"'><span class='\"Apple-converted-space\"'>  </span></span>enable<span class='\"s2\"'><span class='\"Apple-converted-space\"'>  </span></span>our<span class='\"s2\"'><span class='\"Apple-converted-space\"'>  </span></span>clinicians<span class='\"s2\"'><span class='\"Apple-converted-space\"'>  </span></span>to<span class='\"s3\"'><span class='\"Apple-converted-space\"'>  </span></span>thrive,<span class='\"s3\"'><span class='\"Apple-converted-space\"'>  </span></span>SonderMind<span class='\"s3\"'><span class='\"Apple-converted-space\"'>  </span></span>deﬁnes<span class='\"s3\"'><span class='\"Apple-converted-space\"'>  </span></span>care expectations while providing tools such as clinical note-taking, secure telehealth capabilities, outcome measurement, messaging, and direct booking. To follow the latest SonderMind news, get to know our clients, and learn about what it’s like to work at SonderMind, you can follow us on<a href=\"%22https:/www.instagram.com/sondermind/?hl=en%22\" rel=\"nofollow\"><span class='\"s11\"'> Instagram</span></a><span class='\"s12\"'>, <a href=\"%22https:/www.linkedin.com/company/sondermind/%22\" rel=\"nofollow\"><span class='\"s11\"'>Linkedin</span></a></span>, and<a href=\"%22https:/twitter.com/SonderMind?ref_src=twsrc%5Egoogle|twcamp%5Eserp|twgr%5Eauthor%22\" rel=\"nofollow\"><span class='\"s11\"'> Twitter</span></a>.</p>\n<div class=\"h2\"><span class='\"s1\"'><strong>About the Role</strong></span></div>\n<p class='\"p8\"'>As a dynamic and relationship-driven manager, you will develop, strengthen, and enhance SonderMind’s payor relationships nationwide, within an assigned region.  Using your commercial and government payor relationships and your broad knowledge of payor contracting, you will lead negotiations with payors and health plans, resulting in favorable reimbursement and contractual language terms.  You will proactively develop contract negotiation strategies that align with the financial objectives of SonderMind. You are a creative problem-solver and out-of-the-box thinker who is passionate about improving access and outcomes in mental health.  </p>\n<div class=\"h2\"><span class='\"s1\"'><strong>Essential Functions</strong></span></div>\n<ul style=\"\">\n<li style=\"\">Strategically determine where SonderMind could strengthen its in-network participation with payors and engage with new payors to secure in-network agreements. </li>\n<li style=\"\">Develop and analyze complex data sets for use with rate modeling, proposal preparation, and negotiations. </li>\n<li style=\"\">Lead, develop and identify negotiation strategies to optimize partnership opportunities with key payors, while working collaboratively with internal stakeholders to execute and manage such arrangements.   </li>\n<li style=\"\">Cultivate relationships, build partnerships and maintain strong communication with payors. Develop materials used for presentations and lead monthly/quarterly meetings. </li>\n<li style=\"\">Review and analyze contract language and reimbursement terms in existing and potential payor agreements. Recommend modifications that support the business objectives and benefit the company. </li>\n<li style=\"\">Collaborate with and support internal cross functional teams, such as Revenue Cycle, Credentialing, Finance and Legal. Identify areas requiring cross functional problem solving and initiate solutions.  </li>\n<li style=\"\">Investigate and understand payor market dynamics in different states (payor mix changes, reimbursement issues, product offerings and state regulatory statutes)  that will enable you to develop clear value propositions to enhance partnerships with payors. </li>\n<li style=\"\">Own the end to end negotiation and renegotiation process to include application process to initiate new agreements to operationalizing new agreements and/or amendments. This includes loading data into the contract management system and preparing contract summaries of financial and administrative terms. </li>\n<li style=\"\">Other responsibilities and ad-hoc projects based on business needs.</li>\n</ul>\n<div class=\"h2\"><span class='\"s1\"'><strong>What does success look like?</strong></span></div>\n<p class='\"p11\"'><span class='\"s1\"'>Working under the direction of the VP of Payor Strategy, you will work both independently and with the team to proactively identify and execute against strategic initiatives. You have great communication and presentation skills and are able to articulate meaningful messages. You are highly motivated and can overcome complex challenges and roadblocks. You thrive under pressure and are comfortable working in a fast-paced, changing environment. You will be assertive and authoritative to deliver exceptional outcomes.</span></p>\n<div class=\"h2\"><span class='\"s1\"'><strong>Who You Are</strong></span></div>\n<p>Skills, experience, and education that is needed for this person to be able to succeed in this role:</p>\n<ul style=\"\">\n<li style=\"\">Minimum BA/BS in Business Administration, Healthcare Administration or related degree</li>\n<li style=\"\">Minimum five years experience negotiating payor and/or provider agreements </li>\n<li style=\"\">Experience managing relationships and agreements</li>\n<li style=\"\">Knowledge of managed care regulations and laws related to health care, preferably in behavioral health</li>\n<li style=\"\">Experience with alternative payment models, such as Value Based Programs, Risk Arrangements, and Case Rates</li>\n<li style=\"\">Ability to work remotely and to travel to the corporate office and to payor visits or conferences.</li>\n<li style=\"\">Strong negotiation and interpersonal skills: written, verbal, analytical</li>\n<li style=\"\">Motivated and influential – proactive with the ability to adhere to deadlines; work to “get the job done” in a fast-paced environment. </li>\n<li style=\"\">Self-starter with the ability to multitask.</li>\n</ul>\n<div class=\"h2\"><strong>Our Benefits </strong></div>\n<p>The anticipated salary rate for this role is between $120,000 - $135,000 per year.</p>\n<p>As a leader in redesigning behavioral health, we are walking the walk with our employee benefits. We want the experience of working at SonderMind to accelerate people’s careers and enrich their lives, so we focus on meeting SonderMinders wherever they are and supporting them in all facets of their life and work.</p>\n<p>Our benefits include:</p>\n<ul style=\"\">\n<li style=\"\">A commitment to fostering a flexible work environment</li>\n<li style=\"\">A generous (unlimited) PTO policy with a minimum of three weeks off per year</li>\n<li style=\"\">Free therapy coverage benefits to ensure our employees have access to the care they need (must be enrolled in our medical plans to participate)</li>\n<li style=\"\">Competitive Medical, Dental, and Vision coverage with plans to meet every need, including HSA ($1,100 company contribution) and FSA options</li>\n<li style=\"\">Employer-paid short-term, long-term disability, life &amp; AD&amp;D to cover life's unexpected events. Not only that, we also cover the difference in salary for up to seven (7) weeks of short-term disability leave (after the required waiting period) should you need to use it.</li>\n<li style=\"\">Eight weeks of paid Parental Leave (if the parent also qualifies for STD, this benefit is in addition which allows between 8-16 weeks of paid leave)</li>\n<li style=\"\">401K retirement plan with 100% matching which immediately vests on up to 4% of base salary</li>\n<li style=\"\">Travel to Denver 1x a year for annual Shift gathering</li>\n<li style=\"\">Fourteen (14) company holidays</li>\n<li style=\"\">Company Shutdown between Christmas and New Years</li>\n<li style=\"\">Supplemental life insurance, pet insurance coverage, commuter benefits and more!</li>\n</ul>\n<div class=\"h2\"><strong>Application Deadline</strong></div>\n<p>This position will be an ongoing recruitment process and will be open until filled.</p>\n<div class=\"h2\"><strong>Equal Opportunity </strong></div>\n<p>SonderMind does not discriminate in employment opportunities or practices based on race, color, creed, sex, gender, gender identity or expression, pregnancy, childbirth or related medical conditions, religion, veteran and military status, marital status, registered domestic partner status, age, national origin or ancestry, physical or mental disability, medical condition (including genetic information or characteristics), sexual orientation, or any other characteristic protected by applicable federal, state, or local laws.</p>\n<img src=\"https://remotive.com/job/track/1992035/blank.gif?source=public_api\" alt=\"\"/>"
  },
  {
    "id": 1992799,
    "url": "https://remotive.com/remote-jobs/data/staff-product-analyst-1992799",
    "title": "Staff Product Analyst",
    "company_name": "Ethos Life",
    "company_logo": "https://remotive.com/job/1992799/logo",
    "category": "Data Analysis",
    "tags": [
      "python",
      "sql",
      "data visualization",
      "A/B Testing"
    ],
    "job_type": "full_time",
    "publication_date": "2025-04-06T02:51:16",
    "candidate_required_location": "USA",
    "salary": "$133,000 - $236,000",
    "description": "<div class='\"content-intro\"'><p><strong>About Ethos</strong></p>\n<p>Ethos was built to make it faster and easier to get life insurance for the next million families. Our approach blends industry expertise, technology, and the human touch to find you the right policy to protect your loved ones. </p>\n<p>We leverage deep technology and data science to streamline the life insurance process, making it more accessible and convenient. Using predictive analytics, we are able to transform a traditionally multi-week process into a modern digital experience for our users that can take just minutes! We’ve issued billions in coverage each month and eliminated the traditional barriers, ushering the industry into the modern age. Our full-stack technology platform is the backbone of family financial health.</p>\n<p>We make getting life insurance easier, faster and better for everyone. </p>\n<p>Our investors include General Catalyst, Sequoia Capital, Accel Partners, Google Ventures, SoftBank, and the investment vehicles of Jay-Z, Kevin Durant, Robert Downey Jr and others. This year, we were named on CB Insights' Global Insurtech 50 list and BuiltIn's Top 100 Midsize Companies in San Francisco. We are scaling quickly and looking for passionate people to protect the next million families! </p></div><p><strong>About the Role</strong></p>\n<p>We are looking for an ambitious self-starter with a strong track record of delivering results. This role will put you in the middle of the action, requiring you to tackle complex challenges in a rapidly-scaling startup. You will work cross-functionally to generate product insights in our direct-to-consumer business. Through critical thinking and analytical rigor, you will understand user behavior and engagement, enabling us to innovate on our product. You will also provide visibility into performance drivers, empowering leaders to make data-supported decisions. If you thrive in a fast-paced, mission-driven, and impact-oriented environment, we encourage you to apply!</p>\n<p><strong>Duties and Responsibilities:</strong></p>\n<ul style=\"\">\n<li style=\"\">Work closely with PMs to define feature goals and lead A/B testing and experimentation initiatives, including designing tests, tracking events and properties, and analyzing results to understand attribution, causation, and incremental lift</li>\n<li style=\"\">Proactively generate exploratory analyses and in-depth research on large data sets to help product teams uncover high-impact opportunities </li>\n<li style=\"\">Use your wizardly data querying and visualization skills to answer any question in a way that provides actionable insights</li>\n<li style=\"\">Develop easy-to-consume dashboards and frameworks to monitor and visualize KPIs</li>\n<li style=\"\">Influence strategic changes by presenting insights and recommendations to various organizational levels, including executives</li>\n<li style=\"\">Collaborate with data engineers to maintain consistent business logic throughout the organization</li>\n<li style=\"\">Foster a data-driven, test-and-learn culture with your passion for storytelling through data and surfacing insights via analytics, experimentation, and research into the user journey and customer funnel</li>\n</ul>\n<p><strong>Qualifications and Skills:</strong></p>\n<ul style=\"\">\n<li style=\"\">7+ years of experience in data analysis, data science, and/or data-driven product management</li>\n<li style=\"\">Expert knowledge of SQL</li>\n<li style=\"\">Expertise with data visualization tools to convey actionable insights to product managers and business leaders</li>\n<li style=\"\">Experience in A/B testing and experimentation best practices</li>\n<li style=\"\">Knowledge of basic statistical techniques; linear and logistic regression, confidence intervals</li>\n<li style=\"\">Familiarity with a scripting language like Python or R </li>\n<li style=\"\">Proven ability to work independently, multi-task, and thrive in a fast-paced environment</li>\n</ul>\n<p><em>#LI-Remote </em><em>#LI-JA1</em></p>\n<p>The US national base salary range for this full-time position is $133,000 - $236,000. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target for new hire salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. </p>\n<p>Please note that the compensation details listed in US role postings reflect the base salary only and do not include applicable bonus, equity, or benefits. </p>\n<p>You can find further details of our US benefits at https://www.ethoslife.com/careers/</p><div class='\"content-conclusion\"'><p><span style='\"font-weight:'>Don’t meet every single requirement? If you’re excited about this role but your past experience doesn’t align perfectly with every qualification in the job description, we encourage you to apply anyway. At Ethos we are dedicated to building a diverse, inclusive and authentic workplace.</span></p>\n<p><span style='\"font-weight:'>We are an equal opportunity employer who values diversity and inclusion and look for applicants who understand, embrace and thrive in a multicultural world. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. Pursuant to the SF Fair Chance Ordinance, we will consider employment for qualified applicants with arrests and conviction records.</span></p>\n<p>To learn more about what information we collect and how it may be used, please refer to our <a href=\"%22https://res.cloudinary.com/getethos/image/upload/v1684458868/00_CMS/CURRENT_CRPA_Privacy_Notice_for_Job_Applicants_05-23.docx_-_Google_Docs_lr4j43.pdf%22\" rel=\"nofollow\" target='\"_blank\"'>California Candidate Privacy Notice</a>.</p></div><img src=\"https://remotive.com/job/track/1992799/blank.gif?source=public_api\" alt=\"\"/>"
  },
  {
    "id": 1992782,
    "url": "https://remotive.com/remote-jobs/product/product-development-manager-1992782",
    "title": "Product Development Manager",
    "company_name": "Grüns",
    "company_logo": "https://remotive.com/job/1992782/logo",
    "category": "Product",
    "tags": [
      "go",
      "project management",
      "research",
      "product management",
      "packaging",
      "documentation",
      "product development",
      "D2C",
      "asana",
      "chat",
      "startup"
    ],
    "job_type": "full_time",
    "publication_date": "2025-04-06T02:51:10",
    "candidate_required_location": "USA",
    "salary": "",
    "description": "<div class='\"content-intro\"'><p>We're so happy you're here! Thank you for checking our job out and we hope to have the chance to meet you in our interview process!</p></div><div class=\"h2\">About the role</div>\n<p>We’re looking for our first <strong>Product Development Manager</strong> at Grüns! In this role, you will lead our product development project management, driving research into ingredients and claims, innovation, process creation, cross-functional project management, and collaborations with external vendors. If you are an intellectually curious, highly-organized, and science-driven individual and enjoy collaborating with internal and external stakeholders in a fast-paced environment, this is the role for you. This role reports into our Director of Product Development.</p>\n<p><strong>This role is part of our remote HQ! </strong>We have a fully remote, high-trust work environment - and also come together on a bi-annual basis for amazing off-sites where we can connect IRL.</p>\n<div class=\"h2\">In this role, you will:</div>\n<ul style=\"\">\n<li style=\"\"><strong>Product Scientific Research Support: </strong>Leaning into your science background and intellectual curiosity, research trending, upcoming, and relevant nutritional ingredients in the space to fold into our new product innovation. Work cohesively with the R&amp;D Manager to ensure seamless formulations. </li>\n<li style=\"\"><strong>Cross-functional Project Management: </strong>Act as a project manager to coordinate with various teams (Operations, Brand, Performance etc.) and external vendors to align on initiatives, manage communication flows, and ensure timely execution. </li>\n<li style=\"\"><strong>Process Creation &amp; Documentation: </strong>Develop and implement clear, repeatable processes to support product function growth. Create document control for accurate and efficient information flow across teams.</li>\n<li style=\"\"><strong>Vendor Project Management: </strong>Manage relationships with external vendors and suppliers to ensure timely execution and high quality deliverables. </li>\n<li style=\"\"><strong>Support Ad Hoc Requests: </strong>Work closely with other functions to fulfill ad hoc requests and deliver on special projects in a timely manner.</li>\n</ul>\n<div class=\"h2\">We're looking for someone who:</div>\n<ul style=\"\">\n<li style=\"\"><strong>Education: </strong>Bachelor of Science degree in a related field (i.e.: food science, food chemistry, nutrition, etc.) is required.  </li>\n<li style=\"\"><strong>Experience:</strong> 3-5 years in product management, with a focus on creative projects, packaging, or product development.</li>\n<li style=\"\"><strong>Project Management Skills:</strong> Strong experience managing multiple projects across teams in Asana, ensuring timelines are met and deliverables are completed.</li>\n<li style=\"\"><strong>Product Development Research:</strong> Experience working on claims, new trends, and ingredient-related research projects.</li>\n<li style=\"\"><strong>Vendor Management:</strong> Demonstrated ability to manage external vendors and suppliers to ensure timely and accurate deliverables.</li>\n<li style=\"\"><strong>Process Mapping &amp; Documentation:</strong> Experience creating and documenting processes to ensure clarity and efficiency in product development.</li>\n<li style=\"\"><strong>Ownership &amp; Responsibility:</strong> A strong sense of ownership and accountability for your work and projects.</li>\n<li style=\"\"><strong>Organized &amp; Detail-Oriented:</strong> Exceptional organizational skills with the ability to manage multiple projects simultaneously and maintain attention to detail.</li>\n<li style=\"\"><strong>Cross-Functional Leader:</strong> Strong relationship-building skills and the ability to work effectively across teams.</li>\n<li style=\"\"><strong>Strategic Thinker:</strong> Ability to think strategically and creatively to solve problems and optimize processes.</li>\n</ul>\n<p>Bonus points for:</p>\n<ul style=\"\">\n<li style=\"\"><strong>Remote Working:</strong> Experience working in a fully-remote work environment in the past.</li>\n<li style=\"\"><strong>Self-Starter: </strong>Proactive and able to work asynchronously and independently as needed. </li>\n<li style=\"\"><strong>Experience in D2C or CPG:</strong> Previous experience in a direct-to-consumer (D2C) startup or consumer packaged goods (CPG) company.</li>\n<li style=\"\"><strong>Familiarity with Tools:</strong> Proficiency in Asana, Notion, or other project management tools.</li>\n<li style=\"\"><strong>Creative Collaboration:</strong> Experience working closely with design teams on packaging and creative initiatives.</li>\n</ul>\n<p><strong>To Apply: </strong>Please enter your info and share a bit about yourself with us below. We ask that you do not use Chat GPT or similar tools to answer these questions, as it is our hope to genuinely get to know you and the way you communicate and think! We do love integrating these tools into our work though, and you'll hear plenty more about that if you join us.</p><div class='\"content-conclusion\"'><p><strong>A bit about us...</strong></p>\n<p>At Grüns, we believe that foundational nutrition should be simple and convenient for everyone. We're dedicated to bringing comprehensive and real nutrition to you through our gummies, formulated from 60 nutrient-dense and whole-food ingredients. Simply enjoy a grab-and-go snack pack of gummies daily whenever fits best in your schedule and wherever life takes you.</p>\n<p>Like you, we were disappointed. There’s an infinite number of “nutrition” companies, all focused on what’s best for them — not what’s best for you. Hundreds of products to sell you on, low-quality ingredients, and small nutrient doses. We’ve seen it all.</p>\n<p>So we decided it was time to fix it. No more choking on and popping pills like a pharmacy. No more clean-up and disgust from gross powders. And no more cobbling together handfuls to dozens of supplements. Grüns is comprehensive nutrition, made convenient and delicious.</p>\n<p> </p>\n<p><strong>What we care about...</strong></p>\n<p><strong>Autonomy</strong>: Only the best work at Grüns. We’re all confident, independent leaders. We are proactive. We find opportunities for improvement. Don’t ask; just do. When our actions impact other areas of the organization, we communicate with those functional leaders to ensure connectivity.</p>\n<p><strong>Growth</strong>: We love to take on new challenges, learn new things, and express interest in new functions. “I’ve never done this before” is not an excuse; it’s an opportunity.</p>\n<p><strong>Community</strong>: We care deeply about each other. We’re good humans and provide support wherever we can. We care, not just professionally but personally as well.</p>\n<p> </p>\n<p><strong>Compensation &amp; Perks:</strong></p>\n<p>For every role, we aim to have highly competitive compensation and opportunity for impact and career growth.</p>\n<p>Everyone at Grüns works hard, but we believe in wellness and balance too. We have super strong benefits coverage -- for you and your family, generous PTO, free Grüns subscriptions, and a few more perks centered around health and well-being that we can't wait to tell you about!</p></div><img src=\"https://remotive.com/job/track/1992782/blank.gif?source=public_api\" alt=\"\"/>"
  },
  {
    "id": 1992218,
    "url": "https://remotive.com/remote-jobs/software-dev/senior-solution-engineer-data-science-1992218",
    "title": "Senior Solution Engineer, Data Science",
    "company_name": "Taktile",
    "company_logo": "https://remotive.com/job/1992218/logo",
    "category": "Software Development",
    "tags": [
      "data science"
    ],
    "job_type": "full_time",
    "publication_date": "2025-04-06T02:51:05",
    "candidate_required_location": "Northern America, Europe",
    "salary": "",
    "description": "<p style=\"min-height:1.5em\"><strong>About us</strong></p><p style=\"min-height:1.5em\">Taktile exists to create value for organizations through smarter and safer decisions at scale. Our goal is to become the world's leading software provider for automated decision-making in the financial services industry and, to date, our software has been used by our customers to power over 1’000’000 critical business decisions every day.</p><ul style=\"\"><li style=\"\"><p style=\"min-height:1.5em\">Taktile is based in New York City, London, and Berlin. </p></li><li style=\"\"><p style=\"min-height:1.5em\">Taktile was founded by machine learning and data science veterans with extensive experience building and running production ML in financial services. </p></li><li style=\"\"><p style=\"min-height:1.5em\">Our team consists of engineers, entrepreneurs, and researchers with a diverse set of backgrounds. Some of us attended top universities such as Harvard, Oxford, and Stanford and some of us have no degree at all. </p></li><li style=\"\"><p style=\"min-height:1.5em\">Our team has accumulated extensive work experience at leading tech companies such as Google, Amazon, and Meta, startups, and the enterprise software sphere. </p></li><li style=\"\"><p style=\"min-height:1.5em\">Our backers include Y Combinator, Index Ventures, and stellar angels such as the founders of Looker, GitHub, Mulesoft, Datadog, and UiPath.</p></li></ul><p style=\"min-height:1.5em\">We’re backed by some of the world’s leading investors and show great traction with scale-ups and large enterprises across the financial services industry. We are looking to build on this success by growing our team across all seniority levels from software engineers, web developers, marketing and sales experts, and entrepreneurial business analysts.</p><p style=\"min-height:1.5em\"> </p><p style=\"min-height:1.5em\">That's where you come in.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">We are looking for a Solution Engineer with a strong data science / machine learning background to join our Customer Success team on the journey of onboarding our customers and helping them to get value from Taktile fast!</p><p style=\"min-height:1.5em\">If you’re passionate about state-of-the-art tech products, and bring a few years of hands-on experience of applying machine learning models in production to solve real business problems, you’ll thrive in this role. Plus, if you enjoy working in a supportive team environment that empowers you to grow, we think you’ll love this job!</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What you’ll do as Senior Data Science Solution Engineer</strong></p><ul style=\"\"><li style=\"\"><p style=\"min-height:1.5em\">Collaborate with customer teams (including domain experts, product managers, engineers, data scientists, and data engineers) to train, test, and deploy machine learning models tailored to financial services use cases.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Lead the delivery of bespoke data science solutions, encompassing requirements gathering, data exploration, feature engineering, modeling, deployment, and handover to customer teams in both pilot projects and full implementations.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Onboard and support diverse customer teams in solving real-world problems, ensuring a seamless experience and fast time-to-value on the Taktile platform.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Work closely with the product team to develop and refine ML modules—such as off-the-shelf AML and fraud models—ensuring seamless integration and robust functionality.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Collaborate with product management to translate insights from customer interactions into actionable improvements for Taktile’s offerings.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>About You</strong></p><ul style=\"\"><li style=\"\"><p style=\"min-height:1.5em\">You excel at building strong relationships with stakeholders of varying seniority—both technical (e.g., Principal Engineers, Data Scientists) and business-oriented (e.g., Risk Managers, Credit Analysts). You thrive in customer-facing scenarios, proactively seeking innovative ways to engage customers and deliver exceptional value in a competitive landscape.</p></li><li style=\"\"><p style=\"min-height:1.5em\">You have a genuine interest in understanding our customers' businesses and enjoy helping them overcome their challenges.</p></li><li style=\"\"><p style=\"min-height:1.5em\">You’re a solution-oriented professional who can dive deep into technical discussions yet translate complex concepts for broader audiences.</p></li><li style=\"\"><p style=\"min-height:1.5em\">You are an expert in end-to-end data science solution delivery, including requirements gathering, data exploration, modeling, and deployment.</p></li><li style=\"\"><p style=\"min-height:1.5em\">You bring experience deploying machine learning models in production, understanding the operational demands of maintaining these systems at scale.</p></li><li style=\"\"><p style=\"min-height:1.5em\">You possess solid knowledge of REST APIs, including design, integration, and authentication, and have experience with at least one major cloud platform (AWS, Azure, or GCP).</p></li><li style=\"\"><p style=\"min-height:1.5em\">You embody a continuous learning mindset, staying up to date on best practices while readily adapting new skills and methodologies.</p></li><li style=\"\"><p style=\"min-height:1.5em\">You work effectively with cross-functional teams—Sales, Solution Engineering, Product, Engineering, Customer Success—fostering a spirit of collaboration.</p></li><li style=\"\"><p style=\"min-height:1.5em\">You have outstanding written and spoken English skills, enabling you to convey complex ideas clearly and persuasively.</p></li><li style=\"\"><p style=\"min-height:1.5em\">You’re adept at planning and managing project scope, setting expectations and timelines to ensure efficient solution delivery.</p></li><li style=\"\"><p style=\"min-height:1.5em\">You maintain a humble, growth-oriented attitude, always seeking feedback and integrating the latest advancements in data science and machine learning.</p></li></ul><p style=\"min-height:1.5em\"><strong>Ideal Qualifications (but not required)</strong></p><ul style=\"\"><li style=\"\"><p style=\"min-height:1.5em\">You have 3-5 years of experience from a customer facing Data Scientist, ML Engineer position within a B2B SaaS company or as a Senior Consultant with the data science focus from a top tier consulting firm.</p></li><li style=\"\"><p style=\"min-height:1.5em\">You’ve had exposure to the financial services industry before and you’re excited to solve some of the industry's most pressing problems with AI (fraud, money laundering, etc.)</p></li></ul><p style=\"min-height:1.5em\"><strong>What we offer</strong></p><ul style=\"\"><li style=\"\"><p style=\"min-height:1.5em\">Work with colleagues that lift you up, challenge you, celebrate you and help you grow. We come from many different backgrounds, but what we have in common is the desire to operate at the very top of our fields. If you are similarly capable, caring, and driven, you'll find yourself  at home here</p></li><li style=\"\"><p style=\"min-height:1.5em\">Make an impact and meaningfully shape an early-stage company</p></li><li style=\"\"><p style=\"min-height:1.5em\">Experience a truly flat hierarchy and communicate directly with founding team members. Having an opinion and voicing your ideas is not only welcome but encouraged, especially when they challenge the status quo</p></li><li style=\"\"><p style=\"min-height:1.5em\">Learn from experienced mentors and achieve tremendous personal and professional growth. Get to know and leverage our network of leading tech investors and advisors around the globe.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Receive a top-of-market equity and cash compensation package</p></li><li style=\"\"><p style=\"min-height:1.5em\">Get access to a self-development budget you can use to e.g. attend conferences, buy books or take classes.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Use the equipment of your choice including meaningful home office set-up. </p></li></ul><p style=\"min-height:1.5em\"> </p><p style=\"min-height:1.5em\"><strong>Our Stance</strong></p><ul style=\"\"><li style=\"\"><p style=\"min-height:1.5em\">We're eager to meet talented and driven candidates regardless of whether they tick all the boxes. We're looking for someone who will add to our culture, not just fit within it. We strongly encourage individuals from groups traditionally underestimated and underrepresented in tech to apply</p></li><li style=\"\"><p style=\"min-height:1.5em\">We seek to actively recognize and combat racism, sexism, ableism and ageism. We embrace and support all gender identities and expressions, and celebrate love in its many forms. We won't inquire about how you identify or if you've experienced discrimination, but if you want to tell your story, we are all ears</p></li></ul><p style=\"min-height:1.5em\"> </p><p style=\"min-height:1.5em\"></p><img src=\"https://remotive.com/job/track/1992218/blank.gif?source=public_api\" alt=\"\"/>"
  },
  {
    "id": 1992670,
    "url": "https://remotive.com/remote-jobs/finance-legal/finance-assistant-1992670",
    "title": "Finance Assistant",
    "company_name": "Spreetail",
    "company_logo": "https://remotive.com/job/1992670/logo",
    "category": "Finance / Legal",
    "tags": [
      "excel",
      "time management"
    ],
    "job_type": "contract",
    "publication_date": "2025-04-06T00:51:19",
    "candidate_required_location": "Philippines",
    "salary": "",
    "description": "<div><span style=\"\">Spreetail propels brands to increase their ecommerce market share across the globe while improving their operational costs. Learn how we are building one of the fastest-growing ecommerce companies in history: </span><a class=\"postings-link\" href=\"http://www.wearespreetail.com/\" rel=\"nofollow\" style=\"\">www.spreetail.com</a><span style=\"\">.  </span></div><div><br></div><div>Spreetail is seeking a Finance Assistant to assist with the tracking, payments, and analysis within our Europe Platform Service division, The role includes generating detailed invoices, managing weekly reporting, liaising with internal and external stakeholders, and ensuring timely invoice payments. The ideal candidate will have strong data management skills, the ability to work cross-functionally, and a proactive approach to problem-solving.</div><br><br><div class=\"h3\">How you will achieve  success: </div><li style=\"\">Work closely with the Outbound team to understand all outbound shipping costs, track and monitor invoices, and manage weekly reporting.</li><li style=\"\">Work closely with the Operations team to understand all warehouse and personnel costs, track and monitor spend, and manage weekly reporting.</li><li style=\"\">Weekly production of detailed invoices for service customers, with supporting documents in line with contracted terms. Liaising with internal and external stakeholders on invoice calculations and terms</li><li style=\"\">Track invoice payments, and work with the customers to ensure timely receipt of payments. Pulling relevant data from systems and other teams, and collating in a sensible format</li><li style=\"\">Creating weekly reporting for management to review performance and ownership of month-end reporting and deadlines for platform services invoicing</li><br><br><div class=\"h3\">What experiences will help you in this role: </div><li style=\"\">Excellent communication skills, as this role involves liaising with all departments and at all levels.</li><li style=\"\">Strong Excel skills (Pivot tables, VLOOKUPs, etc.) and experience working with high volumes of data.</li><li style=\"\">Finance knowledge (Understanding of a P&amp;L. Comfortable with credit control or accounts receivable experience). </li><li style=\"\">Time management skills, attention to detail, and ability to handle time-pressured deadlines.</li><li style=\"\">Confident working with a variety of stakeholders.</li><div>This is a remote position and requires candidates to have an available work-from-home setup </div><div>Desktop/Laptop system requirements: </div><div>\t- 4th generation or higher, at least Intel i3 or equivalent processor; </div><div>\t- at least 4GB RAM;</div><div>\t- Windows 10 and above or MAC OSX operating system </div><div>\t- You are required to provide your own dual monitors</div><div>A strong and stable internet connection (A DSL, cable or fiber wired internet service with 10 Mbps plan or higher for primary connection)</div><div>PC Headset</div><div>A high-definition (HD) external or integrated webcam with at least 720p resolution.</div><div><br></div><div>#LI-Remote</div><img src=\"https://remotive.com/job/track/1992670/blank.gif?source=public_api\" alt=\"\"/>"
  },
  {
    "id": 1992451,
    "url": "https://remotive.com/remote-jobs/marketing/marketing-coordinator-1992451",
    "title": "Marketing Coordinator",
    "company_name": "PropLogix",
    "company_logo": "https://remotive.com/job/1992451/logo",
    "category": "Marketing",
    "tags": [
      "seo",
      "content marketing",
      "microsoft office"
    ],
    "job_type": "full_time",
    "publication_date": "2025-04-06T00:51:16",
    "candidate_required_location": "Colombia",
    "salary": "cop 3.500.000 per month",
    "description": "<p>We're looking for the perfect fit for our small-but-mighty PropLogix marketing team! We tackle everything from SEO, content marketing, sales support, event coordination, and more. We need an enthusiastic self-starter to join our us as our Marketing Coordinator. In this role, you'll be the operational backbone of our team, providing critical administrative support across various B2B marketing initiatives. From coordinating trade show logistics to managing promotional product inventory (and lots of things in between), you'll ensure our marketing projects run smoothly and effectively. The ideal candidate will be a collaborative team player who is highly-organized and comfortable working on their own. You don't have to know everything about marketing, but passion and eagerness to learn and grow with us will be absolutely necessary! </p><p></p><p><strong>Essential Functions: </strong><br></p><ul style=\"\"><li style=\"\">Helps support essential marketing functions </li></ul><ul style=\"\"><li style=\"\">Maintains conference and event schedule and coordinates logistics for sponsorships, and travel on behalf of sales team </li></ul><ul style=\"\"><li style=\"\">Assist with webinar setup, registration management, and post-event follow-up </li></ul><ul style=\"\"><li style=\"\">Helps maintain marketing databases and organize digital and print assets </li></ul><ul style=\"\"><li style=\"\">Track and manage promotional product inventory, placing orders and finding new items </li></ul><ul style=\"\"><li style=\"\">Help support PropLogix and other brands </li></ul><p><strong>Requirements</strong></p><ul style=\"\"> <li style=\"\"><strong>Applicants must be located in Colombia</strong></li> <li style=\"\">Excellent verbal and written communications skills in English; C1 at minimum but C2 is preferable</li> </ul><ul style=\"\"> <li style=\"\">At minimum 1 year of work experience in marketing </li> <li style=\"\">Bachelor’s Degree in (Preferred) Communications, Marketing, Business, or other related fields of study </li> <li style=\"\">Proficiency with Microsoft Office Suite (Word, Excel, Powerpoint) </li> <li style=\"\">Knowledge of B2B marketing principles </li> <li style=\"\">Excellent communication skills, written and verbal </li> <li style=\"\">Ability to effectively manage time and juggle deadlines <br> </li> </ul><p><strong>Preferred Skills</strong></p><ul style=\"\"> <li style=\"\">HubSpot experience  </li> <li style=\"\">Basic graphic design skills </li> <li style=\"\">Campaign and project management experience </li> <li style=\"\">Hands-on experience in content management </li> <li style=\"\">Knowledge of online marketing channels </li> <li style=\"\">Event or content calendar management  </li> <li style=\"\">HTML email-building experience </li> </ul><p><strong>Benefits</strong></p><p>The Marketing Coordinator role at PropLogix Colombia offers a competitive compensation package designed to recognize both individual performance and commitment to our objectives. Below is a detailed breakdown of the compensation structure:<br> •\t<strong>Base Salary:</strong> COP 3.500.000 per month<br> •\t<strong>Legal Benefits:</strong> Includes all legal benefits<br> •\t<strong>Internet Allowance:</strong> COP 100.000 per month</p><p></p><p>Additionally:</p><ul style=\"\"> <li style=\"\">Indefinite contract after successful completion of training and meeting of objectives during fixed contract</li> <li style=\"\">Internal growth opportunities - we develop our employees and will promote from within while growing this location</li> <li style=\"\">Recognition and Rewards platform that can be exchanged for gift cards</li> <li style=\"\">Ability to work remotely</li> <li style=\"\">Overtime and holiday surcharges paid</li> <li style=\"\">Opportunity to work for a U.S. based company, while honing your English speaking skills in a professional environment</li> <li style=\"\">Access to a global Learning Management System with thousands of professional development courses</li> </ul><br><br><div class=\"h2\">About the company</div><br>PropLogix performs research for real estate transactions using proprietary technology. Most of the work we do is on behalf of closing agents whose job is to juggle documents, multiple parties, and deadlines to get their customers to the closing table. Their job is demanding and time-sensitive, and our purpose is to help make them more efficient and, most importantly, help them protect their customers. The services we perform give homebuyers a clear picture of the financial fees and obligations associated with a property and save them hundreds and thousands in financial liability.  As a remote-first company, our team is ### strong and is comprised of talented and passionate individuals from all over. We're relentless in delivering the best standard of research and committed to an unparalleled level of customer service.  <p><br></p><p>Can’t find the right role? Email your resume to <a class=\"external\" href=\"mailto:proplogix@jobs.workablemail.com\" rel=\"nofollow\">proplogix@jobs.workablemail.com</a> to be considered for new positions in the future.<br></p><p><br>Notice to external Recruiters and Recruitment Agencies:</p><p>PropLogix does not accept unsolicited headhunter and agency resumes. Headhunters and recruitment agencies may not submit resumes/CVs through this website or directly to any employee. PropLogix and any of our subsidiaries will not pay fees to any third-party agency or company.</p><img src=\"https://remotive.com/job/track/1992451/blank.gif?source=public_api\" alt=\"\"/>"
  },
  {
    "id": 1992544,
    "url": "https://remotive.com/remote-jobs/customer-support/customer-success-associate-1992544",
    "title": "Customer Success Associate",
    "company_name": "B12",
    "company_logo": "https://remotive.com/job/1992544/logo",
    "category": "Customer Service",
    "tags": [
      "teaching",
      "chat",
      "startup"
    ],
    "job_type": "full_time",
    "publication_date": "2025-04-06T00:51:09",
    "candidate_required_location": "USA, Argentina, Philippines, Mexico",
    "salary": "",
    "description": "<p>We are an early-stage startup that is hiring an enthusiastic Customer Support Associate to support our growing Customer Success team. We are looking to bring on individuals who want to make sure our clients and experts have an amazing experience working with us! To do this, you will utilize your interpersonal and relationship-building skills to help resolve customer requests in a timely manner. If you are a strong communicator who can dynamically interact with customers over the phone, showing empathy, encouragement, and care, then this could be the right role for you!<br><br>As a Customer Support Associate you will:<br>* Manage email, phone, and chat communication with customers as a primary contact for customers who have questions, concerns, or want additional features for their website.<br>* Support long-term customers with the management of their web presence, helping them when they have questions about the direction of their website.<br>* Learn the tools of our web design suite and assist customers with small design tasks.<br>* Contribute to Knowledge Base/FAQ and other customer-facing support resources.<br><br>You’d be a good fit if:<br>* You have 2+ years of experience supporting American clients or customers in an external-facing role.<br>* You are a quick and clear writer (you must be highly proficient in English) and an amazing communicator.<br>* You have experience in the world of web design helping launch and manage websites.<br>* You have empathy for small business users and can quickly grasp the issues they’re facing.<br>* You feel comfortable managing your time and deciding amongst competing priorities.<br>* You are patient, thoughtful, encouraging, and calm.<br>* You have some familiarity with managing third-party integrations on websites.<br>* You enjoy learning and teaching.<br>* You care about and want to contribute to our mission of helping people do meaningful work.<br>* You are willing to work full-time, 8 hrs/day (9am - 5pm US Eastern Standard Time, New York)<br><br>Don’t fear<br>* We don't have a minimum number of years of experience for this role. We highly favor talent and interest.<br>* Some candidates may see this list and feel discouraged because they don’t match all the items. Please apply anyway: there’s a good chance you’re more wonderful than you think you are.<br>* B12 is a safe place for human beings. We particularly encourage you to apply if you identify as a woman, are a person of color or other underrepresented minority, or are a member of the LGBTQIA community.<br><br>How to apply</p>\n<p>Please provide:<br>* A pointer to your CV, resume, LinkedIn profile, or any other summary of your career so far.<br>* Some informal text introducing yourself and what you are excited about.</p><img src=\"https://remotive.com/job/track/1992544/blank.gif?source=public_api\" alt=\"\"/>"
  },
  {
    "id": 1992219,
    "url": "https://remotive.com/remote-jobs/software-dev/machine-learning-engineer-1992219",
    "title": "Machine Learning Engineer",
    "company_name": "Artera",
    "company_logo": "https://remotive.com/job/1992219/logo",
    "category": "Software Development",
    "tags": [
      "AWS",
      "docker",
      "kubernetes",
      "python"
    ],
    "job_type": "full_time",
    "publication_date": "2025-04-06T00:51:05",
    "candidate_required_location": "USA",
    "salary": "",
    "description": "<div><b>About Us:</b> Artera is an AI startup that develops medical artificial intelligence tests to personalize therapy for cancer patients. Artera is on a mission to personalize medical decisions for patients and physicians on a global scale.</div><div><br></div><div>As a Machine Learning Engineer at Artera, you’ll work on the AI Platform team with a focus on establishing scalable and efficient pipelines for data processing and model training. You’ll work closely with AI model developers, fellow machine learning engineers, and our platform engineering team. You’ll ensure that Artera’s model developers can rely on highly efficient, large-scale training regimes and deploy optimized models to production environments.</div><br><br><div class=\"h3\">Essential Responsibilities:</div><li style=\"\">Build and own tools and libraries that accelerate Artera’s ability to develop, launch, and monitor AI products.</li><li style=\"\">Work with model developers to optimize GPU and CPU efficiency and data throughput of large-scale foundation models and downstream model training runs.</li><li style=\"\">Optimize Artera’s ability to store and process terabytes of digital pathology data efficiently for the use in serving large-scale training regimes.</li><li style=\"\">Ensure that Artera’s observability infrastructure provides a clear picture of how to continue to optimize performance across our model landscape.</li><br><br><div class=\"h3\">Experience Requirements:</div><li style=\"\">4+ years of industry software engineering experience</li><li style=\"\">3+ years of industry experience using one of PyTorch, TensorFlow, or JAX in Python</li><li style=\"\">2+ years of industry experience building with AWS, Docker, and Kubernetes</li><li style=\"\">1+ years of industry experience optimizing large-scale, high data-throughput, distributed machine learning training pipelines</li><br><br><div class=\"h3\">Desired:</div><li style=\"\">Experience using Terraform, SqlAlchemy</li><li style=\"\">Experience using ML orchestration frameworks such as Ray, Kubeflow, Metaflow, MLFlow, Flyte, Dagster, Argo Workflow or Prefect</li><li style=\"\">Experience deploying and maintaining infrastructure for machine learning training and production inference</li><li style=\"\">Familiarity with TorchScript, ONNXRuntime, DeepSpeed, AWS Neuron or similar approaches to inference optimization</li><div><b>Equal Employee Opportunity</b>: At Artera, we value bringing together individuals from diverse backgrounds to develop new and innovative solutions for patients and physicians. As an equal opportunity employer, we do not discriminate on the basis of race, color, religion, national origin, age, sex (including pregnancy), physical or mental disability, medical condition, genetic information gender identity or expression, sexual orientation, marital status, protected veteran status, or any other legally protected characteristic. </div><img src=\"https://remotive.com/job/track/1992219/blank.gif?source=public_api\" alt=\"\"/>"
  }
]